chrydelezuch/3DPrinter/Tests/build/test/mocks/test_stepper_motor/mock_stm32f4xx_hal_tim.h
/* AUTOGENERATED FILE. DO NOT EDIT. */
#ifndef _MOCK_STM32F4XX_HAL_TIM_H
#define _MOCK_STM32F4XX_HAL_TIM_H

#include "unity.h"
#include "stm32f4xx_hal_tim.h"

/* Ignore the following warnings, since we are copying code */
#if defined(__GNUC__) && !defined(__ICC) && !defined(__TMS470__)
#if __GNUC__ > 4 || (__GNUC__ == 4 && (__GNUC_MINOR__ > 6 || (__GNUC_MINOR__ == 6 && __GNUC_PATCHLEVEL__ > 0)))
#pragma GCC diagnostic push
#endif
#if !defined(__clang__)
#pragma GCC diagnostic ignored "-Wpragmas"
#endif
#pragma GCC diagnostic ignored "-Wunknown-pragmas"
#pragma GCC diagnostic ignored "-Wduplicate-decl-specifier"
#endif

#ifdef __cplusplus
extern "C" {
#endif

void mock_stm32f4xx_hal_tim_Init(void);
void mock_stm32f4xx_hal_tim_Destroy(void);
void mock_stm32f4xx_hal_tim_Verify(void);




#define HAL_TIM_Base_Init_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_Base_Init requires _IgnoreAndReturn");
#define HAL_TIM_Base_Init_IgnoreAndReturn(cmock_retval) HAL_TIM_Base_Init_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_Base_Init_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_Base_Init_StopIgnore() HAL_TIM_Base_Init_CMockStopIgnore()
void HAL_TIM_Base_Init_CMockStopIgnore(void);
#define HAL_TIM_Base_Init_Expect(htim) TEST_FAIL_MESSAGE("HAL_TIM_Base_Init requires _ExpectAndReturn");
#define HAL_TIM_Base_Init_ExpectAndReturn(htim, cmock_retval) HAL_TIM_Base_Init_CMockExpectAndReturn(__LINE__, htim, cmock_retval)
void HAL_TIM_Base_Init_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_Base_Init_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_Base_Init_AddCallback(CMOCK_HAL_TIM_Base_Init_CALLBACK Callback);
void HAL_TIM_Base_Init_Stub(CMOCK_HAL_TIM_Base_Init_CALLBACK Callback);
#define HAL_TIM_Base_Init_StubWithCallback HAL_TIM_Base_Init_Stub
#define HAL_TIM_Base_DeInit_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_Base_DeInit requires _IgnoreAndReturn");
#define HAL_TIM_Base_DeInit_IgnoreAndReturn(cmock_retval) HAL_TIM_Base_DeInit_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_Base_DeInit_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_Base_DeInit_StopIgnore() HAL_TIM_Base_DeInit_CMockStopIgnore()
void HAL_TIM_Base_DeInit_CMockStopIgnore(void);
#define HAL_TIM_Base_DeInit_Expect(htim) TEST_FAIL_MESSAGE("HAL_TIM_Base_DeInit requires _ExpectAndReturn");
#define HAL_TIM_Base_DeInit_ExpectAndReturn(htim, cmock_retval) HAL_TIM_Base_DeInit_CMockExpectAndReturn(__LINE__, htim, cmock_retval)
void HAL_TIM_Base_DeInit_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_Base_DeInit_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_Base_DeInit_AddCallback(CMOCK_HAL_TIM_Base_DeInit_CALLBACK Callback);
void HAL_TIM_Base_DeInit_Stub(CMOCK_HAL_TIM_Base_DeInit_CALLBACK Callback);
#define HAL_TIM_Base_DeInit_StubWithCallback HAL_TIM_Base_DeInit_Stub
#define HAL_TIM_Base_MspInit_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_Base_MspInit requires _Ignore (not AndReturn)");
#define HAL_TIM_Base_MspInit_Ignore() HAL_TIM_Base_MspInit_CMockIgnore()
void HAL_TIM_Base_MspInit_CMockIgnore(void);
#define HAL_TIM_Base_MspInit_StopIgnore() HAL_TIM_Base_MspInit_CMockStopIgnore()
void HAL_TIM_Base_MspInit_CMockStopIgnore(void);
#define HAL_TIM_Base_MspInit_ExpectAndReturn(htim, cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_Base_MspInit requires _Expect (not AndReturn)");
#define HAL_TIM_Base_MspInit_Expect(htim) HAL_TIM_Base_MspInit_CMockExpect(__LINE__, htim)
void HAL_TIM_Base_MspInit_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim);
typedef void (* CMOCK_HAL_TIM_Base_MspInit_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_Base_MspInit_AddCallback(CMOCK_HAL_TIM_Base_MspInit_CALLBACK Callback);
void HAL_TIM_Base_MspInit_Stub(CMOCK_HAL_TIM_Base_MspInit_CALLBACK Callback);
#define HAL_TIM_Base_MspInit_StubWithCallback HAL_TIM_Base_MspInit_Stub
#define HAL_TIM_Base_MspDeInit_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_Base_MspDeInit requires _Ignore (not AndReturn)");
#define HAL_TIM_Base_MspDeInit_Ignore() HAL_TIM_Base_MspDeInit_CMockIgnore()
void HAL_TIM_Base_MspDeInit_CMockIgnore(void);
#define HAL_TIM_Base_MspDeInit_StopIgnore() HAL_TIM_Base_MspDeInit_CMockStopIgnore()
void HAL_TIM_Base_MspDeInit_CMockStopIgnore(void);
#define HAL_TIM_Base_MspDeInit_ExpectAndReturn(htim, cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_Base_MspDeInit requires _Expect (not AndReturn)");
#define HAL_TIM_Base_MspDeInit_Expect(htim) HAL_TIM_Base_MspDeInit_CMockExpect(__LINE__, htim)
void HAL_TIM_Base_MspDeInit_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim);
typedef void (* CMOCK_HAL_TIM_Base_MspDeInit_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_Base_MspDeInit_AddCallback(CMOCK_HAL_TIM_Base_MspDeInit_CALLBACK Callback);
void HAL_TIM_Base_MspDeInit_Stub(CMOCK_HAL_TIM_Base_MspDeInit_CALLBACK Callback);
#define HAL_TIM_Base_MspDeInit_StubWithCallback HAL_TIM_Base_MspDeInit_Stub
#define HAL_TIM_Base_Start_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_Base_Start requires _IgnoreAndReturn");
#define HAL_TIM_Base_Start_IgnoreAndReturn(cmock_retval) HAL_TIM_Base_Start_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_Base_Start_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_Base_Start_StopIgnore() HAL_TIM_Base_Start_CMockStopIgnore()
void HAL_TIM_Base_Start_CMockStopIgnore(void);
#define HAL_TIM_Base_Start_Expect(htim) TEST_FAIL_MESSAGE("HAL_TIM_Base_Start requires _ExpectAndReturn");
#define HAL_TIM_Base_Start_ExpectAndReturn(htim, cmock_retval) HAL_TIM_Base_Start_CMockExpectAndReturn(__LINE__, htim, cmock_retval)
void HAL_TIM_Base_Start_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_Base_Start_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_Base_Start_AddCallback(CMOCK_HAL_TIM_Base_Start_CALLBACK Callback);
void HAL_TIM_Base_Start_Stub(CMOCK_HAL_TIM_Base_Start_CALLBACK Callback);
#define HAL_TIM_Base_Start_StubWithCallback HAL_TIM_Base_Start_Stub
#define HAL_TIM_Base_Stop_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_Base_Stop requires _IgnoreAndReturn");
#define HAL_TIM_Base_Stop_IgnoreAndReturn(cmock_retval) HAL_TIM_Base_Stop_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_Base_Stop_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_Base_Stop_StopIgnore() HAL_TIM_Base_Stop_CMockStopIgnore()
void HAL_TIM_Base_Stop_CMockStopIgnore(void);
#define HAL_TIM_Base_Stop_Expect(htim) TEST_FAIL_MESSAGE("HAL_TIM_Base_Stop requires _ExpectAndReturn");
#define HAL_TIM_Base_Stop_ExpectAndReturn(htim, cmock_retval) HAL_TIM_Base_Stop_CMockExpectAndReturn(__LINE__, htim, cmock_retval)
void HAL_TIM_Base_Stop_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_Base_Stop_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_Base_Stop_AddCallback(CMOCK_HAL_TIM_Base_Stop_CALLBACK Callback);
void HAL_TIM_Base_Stop_Stub(CMOCK_HAL_TIM_Base_Stop_CALLBACK Callback);
#define HAL_TIM_Base_Stop_StubWithCallback HAL_TIM_Base_Stop_Stub
#define HAL_TIM_Base_Start_IT_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_Base_Start_IT requires _IgnoreAndReturn");
#define HAL_TIM_Base_Start_IT_IgnoreAndReturn(cmock_retval) HAL_TIM_Base_Start_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_Base_Start_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_Base_Start_IT_StopIgnore() HAL_TIM_Base_Start_IT_CMockStopIgnore()
void HAL_TIM_Base_Start_IT_CMockStopIgnore(void);
#define HAL_TIM_Base_Start_IT_Expect(htim) TEST_FAIL_MESSAGE("HAL_TIM_Base_Start_IT requires _ExpectAndReturn");
#define HAL_TIM_Base_Start_IT_ExpectAndReturn(htim, cmock_retval) HAL_TIM_Base_Start_IT_CMockExpectAndReturn(__LINE__, htim, cmock_retval)
void HAL_TIM_Base_Start_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_Base_Start_IT_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_Base_Start_IT_AddCallback(CMOCK_HAL_TIM_Base_Start_IT_CALLBACK Callback);
void HAL_TIM_Base_Start_IT_Stub(CMOCK_HAL_TIM_Base_Start_IT_CALLBACK Callback);
#define HAL_TIM_Base_Start_IT_StubWithCallback HAL_TIM_Base_Start_IT_Stub
#define HAL_TIM_Base_Stop_IT_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_Base_Stop_IT requires _IgnoreAndReturn");
#define HAL_TIM_Base_Stop_IT_IgnoreAndReturn(cmock_retval) HAL_TIM_Base_Stop_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_Base_Stop_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_Base_Stop_IT_StopIgnore() HAL_TIM_Base_Stop_IT_CMockStopIgnore()
void HAL_TIM_Base_Stop_IT_CMockStopIgnore(void);
#define HAL_TIM_Base_Stop_IT_Expect(htim) TEST_FAIL_MESSAGE("HAL_TIM_Base_Stop_IT requires _ExpectAndReturn");
#define HAL_TIM_Base_Stop_IT_ExpectAndReturn(htim, cmock_retval) HAL_TIM_Base_Stop_IT_CMockExpectAndReturn(__LINE__, htim, cmock_retval)
void HAL_TIM_Base_Stop_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_Base_Stop_IT_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_Base_Stop_IT_AddCallback(CMOCK_HAL_TIM_Base_Stop_IT_CALLBACK Callback);
void HAL_TIM_Base_Stop_IT_Stub(CMOCK_HAL_TIM_Base_Stop_IT_CALLBACK Callback);
#define HAL_TIM_Base_Stop_IT_StubWithCallback HAL_TIM_Base_Stop_IT_Stub
#define HAL_TIM_Base_Start_DMA_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_Base_Start_DMA requires _IgnoreAndReturn");
#define HAL_TIM_Base_Start_DMA_IgnoreAndReturn(cmock_retval) HAL_TIM_Base_Start_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_Base_Start_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_Base_Start_DMA_StopIgnore() HAL_TIM_Base_Start_DMA_CMockStopIgnore()
void HAL_TIM_Base_Start_DMA_CMockStopIgnore(void);
#define HAL_TIM_Base_Start_DMA_Expect(htim, pData, Length) TEST_FAIL_MESSAGE("HAL_TIM_Base_Start_DMA requires _ExpectAndReturn");
#define HAL_TIM_Base_Start_DMA_ExpectAndReturn(htim, pData, Length, cmock_retval) HAL_TIM_Base_Start_DMA_CMockExpectAndReturn(__LINE__, htim, pData, Length, cmock_retval)
void HAL_TIM_Base_Start_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, const uint32_t* pData, uint16_t Length, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_Base_Start_DMA_CALLBACK)(TIM_HandleTypeDef* htim, const uint32_t* pData, uint16_t Length, int cmock_num_calls);
void HAL_TIM_Base_Start_DMA_AddCallback(CMOCK_HAL_TIM_Base_Start_DMA_CALLBACK Callback);
void HAL_TIM_Base_Start_DMA_Stub(CMOCK_HAL_TIM_Base_Start_DMA_CALLBACK Callback);
#define HAL_TIM_Base_Start_DMA_StubWithCallback HAL_TIM_Base_Start_DMA_Stub
#define HAL_TIM_Base_Stop_DMA_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_Base_Stop_DMA requires _IgnoreAndReturn");
#define HAL_TIM_Base_Stop_DMA_IgnoreAndReturn(cmock_retval) HAL_TIM_Base_Stop_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_Base_Stop_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_Base_Stop_DMA_StopIgnore() HAL_TIM_Base_Stop_DMA_CMockStopIgnore()
void HAL_TIM_Base_Stop_DMA_CMockStopIgnore(void);
#define HAL_TIM_Base_Stop_DMA_Expect(htim) TEST_FAIL_MESSAGE("HAL_TIM_Base_Stop_DMA requires _ExpectAndReturn");
#define HAL_TIM_Base_Stop_DMA_ExpectAndReturn(htim, cmock_retval) HAL_TIM_Base_Stop_DMA_CMockExpectAndReturn(__LINE__, htim, cmock_retval)
void HAL_TIM_Base_Stop_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_Base_Stop_DMA_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_Base_Stop_DMA_AddCallback(CMOCK_HAL_TIM_Base_Stop_DMA_CALLBACK Callback);
void HAL_TIM_Base_Stop_DMA_Stub(CMOCK_HAL_TIM_Base_Stop_DMA_CALLBACK Callback);
#define HAL_TIM_Base_Stop_DMA_StubWithCallback HAL_TIM_Base_Stop_DMA_Stub
#define HAL_TIM_OC_Init_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_OC_Init requires _IgnoreAndReturn");
#define HAL_TIM_OC_Init_IgnoreAndReturn(cmock_retval) HAL_TIM_OC_Init_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_OC_Init_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_OC_Init_StopIgnore() HAL_TIM_OC_Init_CMockStopIgnore()
void HAL_TIM_OC_Init_CMockStopIgnore(void);
#define HAL_TIM_OC_Init_Expect(htim) TEST_FAIL_MESSAGE("HAL_TIM_OC_Init requires _ExpectAndReturn");
#define HAL_TIM_OC_Init_ExpectAndReturn(htim, cmock_retval) HAL_TIM_OC_Init_CMockExpectAndReturn(__LINE__, htim, cmock_retval)
void HAL_TIM_OC_Init_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_OC_Init_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_OC_Init_AddCallback(CMOCK_HAL_TIM_OC_Init_CALLBACK Callback);
void HAL_TIM_OC_Init_Stub(CMOCK_HAL_TIM_OC_Init_CALLBACK Callback);
#define HAL_TIM_OC_Init_StubWithCallback HAL_TIM_OC_Init_Stub
#define HAL_TIM_OC_DeInit_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_OC_DeInit requires _IgnoreAndReturn");
#define HAL_TIM_OC_DeInit_IgnoreAndReturn(cmock_retval) HAL_TIM_OC_DeInit_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_OC_DeInit_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_OC_DeInit_StopIgnore() HAL_TIM_OC_DeInit_CMockStopIgnore()
void HAL_TIM_OC_DeInit_CMockStopIgnore(void);
#define HAL_TIM_OC_DeInit_Expect(htim) TEST_FAIL_MESSAGE("HAL_TIM_OC_DeInit requires _ExpectAndReturn");
#define HAL_TIM_OC_DeInit_ExpectAndReturn(htim, cmock_retval) HAL_TIM_OC_DeInit_CMockExpectAndReturn(__LINE__, htim, cmock_retval)
void HAL_TIM_OC_DeInit_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_OC_DeInit_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_OC_DeInit_AddCallback(CMOCK_HAL_TIM_OC_DeInit_CALLBACK Callback);
void HAL_TIM_OC_DeInit_Stub(CMOCK_HAL_TIM_OC_DeInit_CALLBACK Callback);
#define HAL_TIM_OC_DeInit_StubWithCallback HAL_TIM_OC_DeInit_Stub
#define HAL_TIM_OC_MspInit_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_OC_MspInit requires _Ignore (not AndReturn)");
#define HAL_TIM_OC_MspInit_Ignore() HAL_TIM_OC_MspInit_CMockIgnore()
void HAL_TIM_OC_MspInit_CMockIgnore(void);
#define HAL_TIM_OC_MspInit_StopIgnore() HAL_TIM_OC_MspInit_CMockStopIgnore()
void HAL_TIM_OC_MspInit_CMockStopIgnore(void);
#define HAL_TIM_OC_MspInit_ExpectAndReturn(htim, cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_OC_MspInit requires _Expect (not AndReturn)");
#define HAL_TIM_OC_MspInit_Expect(htim) HAL_TIM_OC_MspInit_CMockExpect(__LINE__, htim)
void HAL_TIM_OC_MspInit_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim);
typedef void (* CMOCK_HAL_TIM_OC_MspInit_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_OC_MspInit_AddCallback(CMOCK_HAL_TIM_OC_MspInit_CALLBACK Callback);
void HAL_TIM_OC_MspInit_Stub(CMOCK_HAL_TIM_OC_MspInit_CALLBACK Callback);
#define HAL_TIM_OC_MspInit_StubWithCallback HAL_TIM_OC_MspInit_Stub
#define HAL_TIM_OC_MspDeInit_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_OC_MspDeInit requires _Ignore (not AndReturn)");
#define HAL_TIM_OC_MspDeInit_Ignore() HAL_TIM_OC_MspDeInit_CMockIgnore()
void HAL_TIM_OC_MspDeInit_CMockIgnore(void);
#define HAL_TIM_OC_MspDeInit_StopIgnore() HAL_TIM_OC_MspDeInit_CMockStopIgnore()
void HAL_TIM_OC_MspDeInit_CMockStopIgnore(void);
#define HAL_TIM_OC_MspDeInit_ExpectAndReturn(htim, cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_OC_MspDeInit requires _Expect (not AndReturn)");
#define HAL_TIM_OC_MspDeInit_Expect(htim) HAL_TIM_OC_MspDeInit_CMockExpect(__LINE__, htim)
void HAL_TIM_OC_MspDeInit_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim);
typedef void (* CMOCK_HAL_TIM_OC_MspDeInit_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_OC_MspDeInit_AddCallback(CMOCK_HAL_TIM_OC_MspDeInit_CALLBACK Callback);
void HAL_TIM_OC_MspDeInit_Stub(CMOCK_HAL_TIM_OC_MspDeInit_CALLBACK Callback);
#define HAL_TIM_OC_MspDeInit_StubWithCallback HAL_TIM_OC_MspDeInit_Stub
#define HAL_TIM_OC_Start_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_OC_Start requires _IgnoreAndReturn");
#define HAL_TIM_OC_Start_IgnoreAndReturn(cmock_retval) HAL_TIM_OC_Start_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_OC_Start_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_OC_Start_StopIgnore() HAL_TIM_OC_Start_CMockStopIgnore()
void HAL_TIM_OC_Start_CMockStopIgnore(void);
#define HAL_TIM_OC_Start_Expect(htim, Channel) TEST_FAIL_MESSAGE("HAL_TIM_OC_Start requires _ExpectAndReturn");
#define HAL_TIM_OC_Start_ExpectAndReturn(htim, Channel, cmock_retval) HAL_TIM_OC_Start_CMockExpectAndReturn(__LINE__, htim, Channel, cmock_retval)
void HAL_TIM_OC_Start_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t Channel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_OC_Start_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t Channel, int cmock_num_calls);
void HAL_TIM_OC_Start_AddCallback(CMOCK_HAL_TIM_OC_Start_CALLBACK Callback);
void HAL_TIM_OC_Start_Stub(CMOCK_HAL_TIM_OC_Start_CALLBACK Callback);
#define HAL_TIM_OC_Start_StubWithCallback HAL_TIM_OC_Start_Stub
#define HAL_TIM_OC_Stop_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_OC_Stop requires _IgnoreAndReturn");
#define HAL_TIM_OC_Stop_IgnoreAndReturn(cmock_retval) HAL_TIM_OC_Stop_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_OC_Stop_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_OC_Stop_StopIgnore() HAL_TIM_OC_Stop_CMockStopIgnore()
void HAL_TIM_OC_Stop_CMockStopIgnore(void);
#define HAL_TIM_OC_Stop_Expect(htim, Channel) TEST_FAIL_MESSAGE("HAL_TIM_OC_Stop requires _ExpectAndReturn");
#define HAL_TIM_OC_Stop_ExpectAndReturn(htim, Channel, cmock_retval) HAL_TIM_OC_Stop_CMockExpectAndReturn(__LINE__, htim, Channel, cmock_retval)
void HAL_TIM_OC_Stop_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t Channel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_OC_Stop_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t Channel, int cmock_num_calls);
void HAL_TIM_OC_Stop_AddCallback(CMOCK_HAL_TIM_OC_Stop_CALLBACK Callback);
void HAL_TIM_OC_Stop_Stub(CMOCK_HAL_TIM_OC_Stop_CALLBACK Callback);
#define HAL_TIM_OC_Stop_StubWithCallback HAL_TIM_OC_Stop_Stub
#define HAL_TIM_OC_Start_IT_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_OC_Start_IT requires _IgnoreAndReturn");
#define HAL_TIM_OC_Start_IT_IgnoreAndReturn(cmock_retval) HAL_TIM_OC_Start_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_OC_Start_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_OC_Start_IT_StopIgnore() HAL_TIM_OC_Start_IT_CMockStopIgnore()
void HAL_TIM_OC_Start_IT_CMockStopIgnore(void);
#define HAL_TIM_OC_Start_IT_Expect(htim, Channel) TEST_FAIL_MESSAGE("HAL_TIM_OC_Start_IT requires _ExpectAndReturn");
#define HAL_TIM_OC_Start_IT_ExpectAndReturn(htim, Channel, cmock_retval) HAL_TIM_OC_Start_IT_CMockExpectAndReturn(__LINE__, htim, Channel, cmock_retval)
void HAL_TIM_OC_Start_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t Channel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_OC_Start_IT_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t Channel, int cmock_num_calls);
void HAL_TIM_OC_Start_IT_AddCallback(CMOCK_HAL_TIM_OC_Start_IT_CALLBACK Callback);
void HAL_TIM_OC_Start_IT_Stub(CMOCK_HAL_TIM_OC_Start_IT_CALLBACK Callback);
#define HAL_TIM_OC_Start_IT_StubWithCallback HAL_TIM_OC_Start_IT_Stub
#define HAL_TIM_OC_Stop_IT_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_OC_Stop_IT requires _IgnoreAndReturn");
#define HAL_TIM_OC_Stop_IT_IgnoreAndReturn(cmock_retval) HAL_TIM_OC_Stop_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_OC_Stop_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_OC_Stop_IT_StopIgnore() HAL_TIM_OC_Stop_IT_CMockStopIgnore()
void HAL_TIM_OC_Stop_IT_CMockStopIgnore(void);
#define HAL_TIM_OC_Stop_IT_Expect(htim, Channel) TEST_FAIL_MESSAGE("HAL_TIM_OC_Stop_IT requires _ExpectAndReturn");
#define HAL_TIM_OC_Stop_IT_ExpectAndReturn(htim, Channel, cmock_retval) HAL_TIM_OC_Stop_IT_CMockExpectAndReturn(__LINE__, htim, Channel, cmock_retval)
void HAL_TIM_OC_Stop_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t Channel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_OC_Stop_IT_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t Channel, int cmock_num_calls);
void HAL_TIM_OC_Stop_IT_AddCallback(CMOCK_HAL_TIM_OC_Stop_IT_CALLBACK Callback);
void HAL_TIM_OC_Stop_IT_Stub(CMOCK_HAL_TIM_OC_Stop_IT_CALLBACK Callback);
#define HAL_TIM_OC_Stop_IT_StubWithCallback HAL_TIM_OC_Stop_IT_Stub
#define HAL_TIM_OC_Start_DMA_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_OC_Start_DMA requires _IgnoreAndReturn");
#define HAL_TIM_OC_Start_DMA_IgnoreAndReturn(cmock_retval) HAL_TIM_OC_Start_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_OC_Start_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_OC_Start_DMA_StopIgnore() HAL_TIM_OC_Start_DMA_CMockStopIgnore()
void HAL_TIM_OC_Start_DMA_CMockStopIgnore(void);
#define HAL_TIM_OC_Start_DMA_Expect(htim, Channel, pData, Length) TEST_FAIL_MESSAGE("HAL_TIM_OC_Start_DMA requires _ExpectAndReturn");
#define HAL_TIM_OC_Start_DMA_ExpectAndReturn(htim, Channel, pData, Length, cmock_retval) HAL_TIM_OC_Start_DMA_CMockExpectAndReturn(__LINE__, htim, Channel, pData, Length, cmock_retval)
void HAL_TIM_OC_Start_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t Channel, const uint32_t* pData, uint16_t Length, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_OC_Start_DMA_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t Channel, const uint32_t* pData, uint16_t Length, int cmock_num_calls);
void HAL_TIM_OC_Start_DMA_AddCallback(CMOCK_HAL_TIM_OC_Start_DMA_CALLBACK Callback);
void HAL_TIM_OC_Start_DMA_Stub(CMOCK_HAL_TIM_OC_Start_DMA_CALLBACK Callback);
#define HAL_TIM_OC_Start_DMA_StubWithCallback HAL_TIM_OC_Start_DMA_Stub
#define HAL_TIM_OC_Stop_DMA_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_OC_Stop_DMA requires _IgnoreAndReturn");
#define HAL_TIM_OC_Stop_DMA_IgnoreAndReturn(cmock_retval) HAL_TIM_OC_Stop_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_OC_Stop_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_OC_Stop_DMA_StopIgnore() HAL_TIM_OC_Stop_DMA_CMockStopIgnore()
void HAL_TIM_OC_Stop_DMA_CMockStopIgnore(void);
#define HAL_TIM_OC_Stop_DMA_Expect(htim, Channel) TEST_FAIL_MESSAGE("HAL_TIM_OC_Stop_DMA requires _ExpectAndReturn");
#define HAL_TIM_OC_Stop_DMA_ExpectAndReturn(htim, Channel, cmock_retval) HAL_TIM_OC_Stop_DMA_CMockExpectAndReturn(__LINE__, htim, Channel, cmock_retval)
void HAL_TIM_OC_Stop_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t Channel, HAL_StatusTypeDef cmock_to_return);
