chrydelezuch/3DPrinter/Tests/build/test/mocks/test_stepper_motor/mock_stm32f4xx_hal_tim.h
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_OC_Stop_DMA_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t Channel, int cmock_num_calls);
void HAL_TIM_OC_Stop_DMA_AddCallback(CMOCK_HAL_TIM_OC_Stop_DMA_CALLBACK Callback);
void HAL_TIM_OC_Stop_DMA_Stub(CMOCK_HAL_TIM_OC_Stop_DMA_CALLBACK Callback);
#define HAL_TIM_OC_Stop_DMA_StubWithCallback HAL_TIM_OC_Stop_DMA_Stub
#define HAL_TIM_PWM_Init_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_PWM_Init requires _IgnoreAndReturn");
#define HAL_TIM_PWM_Init_IgnoreAndReturn(cmock_retval) HAL_TIM_PWM_Init_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_PWM_Init_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_PWM_Init_StopIgnore() HAL_TIM_PWM_Init_CMockStopIgnore()
void HAL_TIM_PWM_Init_CMockStopIgnore(void);
#define HAL_TIM_PWM_Init_Expect(htim) TEST_FAIL_MESSAGE("HAL_TIM_PWM_Init requires _ExpectAndReturn");
#define HAL_TIM_PWM_Init_ExpectAndReturn(htim, cmock_retval) HAL_TIM_PWM_Init_CMockExpectAndReturn(__LINE__, htim, cmock_retval)
void HAL_TIM_PWM_Init_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_PWM_Init_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_PWM_Init_AddCallback(CMOCK_HAL_TIM_PWM_Init_CALLBACK Callback);
void HAL_TIM_PWM_Init_Stub(CMOCK_HAL_TIM_PWM_Init_CALLBACK Callback);
#define HAL_TIM_PWM_Init_StubWithCallback HAL_TIM_PWM_Init_Stub
#define HAL_TIM_PWM_DeInit_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_PWM_DeInit requires _IgnoreAndReturn");
#define HAL_TIM_PWM_DeInit_IgnoreAndReturn(cmock_retval) HAL_TIM_PWM_DeInit_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_PWM_DeInit_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_PWM_DeInit_StopIgnore() HAL_TIM_PWM_DeInit_CMockStopIgnore()
void HAL_TIM_PWM_DeInit_CMockStopIgnore(void);
#define HAL_TIM_PWM_DeInit_Expect(htim) TEST_FAIL_MESSAGE("HAL_TIM_PWM_DeInit requires _ExpectAndReturn");
#define HAL_TIM_PWM_DeInit_ExpectAndReturn(htim, cmock_retval) HAL_TIM_PWM_DeInit_CMockExpectAndReturn(__LINE__, htim, cmock_retval)
void HAL_TIM_PWM_DeInit_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_PWM_DeInit_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_PWM_DeInit_AddCallback(CMOCK_HAL_TIM_PWM_DeInit_CALLBACK Callback);
void HAL_TIM_PWM_DeInit_Stub(CMOCK_HAL_TIM_PWM_DeInit_CALLBACK Callback);
#define HAL_TIM_PWM_DeInit_StubWithCallback HAL_TIM_PWM_DeInit_Stub
#define HAL_TIM_PWM_MspInit_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_PWM_MspInit requires _Ignore (not AndReturn)");
#define HAL_TIM_PWM_MspInit_Ignore() HAL_TIM_PWM_MspInit_CMockIgnore()
void HAL_TIM_PWM_MspInit_CMockIgnore(void);
#define HAL_TIM_PWM_MspInit_StopIgnore() HAL_TIM_PWM_MspInit_CMockStopIgnore()
void HAL_TIM_PWM_MspInit_CMockStopIgnore(void);
#define HAL_TIM_PWM_MspInit_ExpectAndReturn(htim, cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_PWM_MspInit requires _Expect (not AndReturn)");
#define HAL_TIM_PWM_MspInit_Expect(htim) HAL_TIM_PWM_MspInit_CMockExpect(__LINE__, htim)
void HAL_TIM_PWM_MspInit_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim);
typedef void (* CMOCK_HAL_TIM_PWM_MspInit_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_PWM_MspInit_AddCallback(CMOCK_HAL_TIM_PWM_MspInit_CALLBACK Callback);
void HAL_TIM_PWM_MspInit_Stub(CMOCK_HAL_TIM_PWM_MspInit_CALLBACK Callback);
#define HAL_TIM_PWM_MspInit_StubWithCallback HAL_TIM_PWM_MspInit_Stub
#define HAL_TIM_PWM_MspDeInit_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_PWM_MspDeInit requires _Ignore (not AndReturn)");
#define HAL_TIM_PWM_MspDeInit_Ignore() HAL_TIM_PWM_MspDeInit_CMockIgnore()
void HAL_TIM_PWM_MspDeInit_CMockIgnore(void);
#define HAL_TIM_PWM_MspDeInit_StopIgnore() HAL_TIM_PWM_MspDeInit_CMockStopIgnore()
void HAL_TIM_PWM_MspDeInit_CMockStopIgnore(void);
#define HAL_TIM_PWM_MspDeInit_ExpectAndReturn(htim, cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_PWM_MspDeInit requires _Expect (not AndReturn)");
#define HAL_TIM_PWM_MspDeInit_Expect(htim) HAL_TIM_PWM_MspDeInit_CMockExpect(__LINE__, htim)
void HAL_TIM_PWM_MspDeInit_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim);
typedef void (* CMOCK_HAL_TIM_PWM_MspDeInit_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_PWM_MspDeInit_AddCallback(CMOCK_HAL_TIM_PWM_MspDeInit_CALLBACK Callback);
void HAL_TIM_PWM_MspDeInit_Stub(CMOCK_HAL_TIM_PWM_MspDeInit_CALLBACK Callback);
#define HAL_TIM_PWM_MspDeInit_StubWithCallback HAL_TIM_PWM_MspDeInit_Stub
#define HAL_TIM_PWM_Start_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_PWM_Start requires _IgnoreAndReturn");
#define HAL_TIM_PWM_Start_IgnoreAndReturn(cmock_retval) HAL_TIM_PWM_Start_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_PWM_Start_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_PWM_Start_StopIgnore() HAL_TIM_PWM_Start_CMockStopIgnore()
void HAL_TIM_PWM_Start_CMockStopIgnore(void);
#define HAL_TIM_PWM_Start_Expect(htim, Channel) TEST_FAIL_MESSAGE("HAL_TIM_PWM_Start requires _ExpectAndReturn");
#define HAL_TIM_PWM_Start_ExpectAndReturn(htim, Channel, cmock_retval) HAL_TIM_PWM_Start_CMockExpectAndReturn(__LINE__, htim, Channel, cmock_retval)
void HAL_TIM_PWM_Start_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t Channel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_PWM_Start_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t Channel, int cmock_num_calls);
void HAL_TIM_PWM_Start_AddCallback(CMOCK_HAL_TIM_PWM_Start_CALLBACK Callback);
void HAL_TIM_PWM_Start_Stub(CMOCK_HAL_TIM_PWM_Start_CALLBACK Callback);
#define HAL_TIM_PWM_Start_StubWithCallback HAL_TIM_PWM_Start_Stub
#define HAL_TIM_PWM_Stop_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_PWM_Stop requires _IgnoreAndReturn");
#define HAL_TIM_PWM_Stop_IgnoreAndReturn(cmock_retval) HAL_TIM_PWM_Stop_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_PWM_Stop_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_PWM_Stop_StopIgnore() HAL_TIM_PWM_Stop_CMockStopIgnore()
void HAL_TIM_PWM_Stop_CMockStopIgnore(void);
#define HAL_TIM_PWM_Stop_Expect(htim, Channel) TEST_FAIL_MESSAGE("HAL_TIM_PWM_Stop requires _ExpectAndReturn");
#define HAL_TIM_PWM_Stop_ExpectAndReturn(htim, Channel, cmock_retval) HAL_TIM_PWM_Stop_CMockExpectAndReturn(__LINE__, htim, Channel, cmock_retval)
void HAL_TIM_PWM_Stop_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t Channel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_PWM_Stop_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t Channel, int cmock_num_calls);
void HAL_TIM_PWM_Stop_AddCallback(CMOCK_HAL_TIM_PWM_Stop_CALLBACK Callback);
void HAL_TIM_PWM_Stop_Stub(CMOCK_HAL_TIM_PWM_Stop_CALLBACK Callback);
#define HAL_TIM_PWM_Stop_StubWithCallback HAL_TIM_PWM_Stop_Stub
#define HAL_TIM_PWM_Start_IT_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_PWM_Start_IT requires _IgnoreAndReturn");
#define HAL_TIM_PWM_Start_IT_IgnoreAndReturn(cmock_retval) HAL_TIM_PWM_Start_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_PWM_Start_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_PWM_Start_IT_StopIgnore() HAL_TIM_PWM_Start_IT_CMockStopIgnore()
void HAL_TIM_PWM_Start_IT_CMockStopIgnore(void);
#define HAL_TIM_PWM_Start_IT_Expect(htim, Channel) TEST_FAIL_MESSAGE("HAL_TIM_PWM_Start_IT requires _ExpectAndReturn");
#define HAL_TIM_PWM_Start_IT_ExpectAndReturn(htim, Channel, cmock_retval) HAL_TIM_PWM_Start_IT_CMockExpectAndReturn(__LINE__, htim, Channel, cmock_retval)
void HAL_TIM_PWM_Start_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t Channel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_PWM_Start_IT_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t Channel, int cmock_num_calls);
void HAL_TIM_PWM_Start_IT_AddCallback(CMOCK_HAL_TIM_PWM_Start_IT_CALLBACK Callback);
void HAL_TIM_PWM_Start_IT_Stub(CMOCK_HAL_TIM_PWM_Start_IT_CALLBACK Callback);
#define HAL_TIM_PWM_Start_IT_StubWithCallback HAL_TIM_PWM_Start_IT_Stub
#define HAL_TIM_PWM_Stop_IT_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_PWM_Stop_IT requires _IgnoreAndReturn");
#define HAL_TIM_PWM_Stop_IT_IgnoreAndReturn(cmock_retval) HAL_TIM_PWM_Stop_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_PWM_Stop_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_PWM_Stop_IT_StopIgnore() HAL_TIM_PWM_Stop_IT_CMockStopIgnore()
void HAL_TIM_PWM_Stop_IT_CMockStopIgnore(void);
#define HAL_TIM_PWM_Stop_IT_Expect(htim, Channel) TEST_FAIL_MESSAGE("HAL_TIM_PWM_Stop_IT requires _ExpectAndReturn");
#define HAL_TIM_PWM_Stop_IT_ExpectAndReturn(htim, Channel, cmock_retval) HAL_TIM_PWM_Stop_IT_CMockExpectAndReturn(__LINE__, htim, Channel, cmock_retval)
void HAL_TIM_PWM_Stop_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t Channel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_PWM_Stop_IT_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t Channel, int cmock_num_calls);
void HAL_TIM_PWM_Stop_IT_AddCallback(CMOCK_HAL_TIM_PWM_Stop_IT_CALLBACK Callback);
void HAL_TIM_PWM_Stop_IT_Stub(CMOCK_HAL_TIM_PWM_Stop_IT_CALLBACK Callback);
#define HAL_TIM_PWM_Stop_IT_StubWithCallback HAL_TIM_PWM_Stop_IT_Stub
#define HAL_TIM_PWM_Start_DMA_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_PWM_Start_DMA requires _IgnoreAndReturn");
#define HAL_TIM_PWM_Start_DMA_IgnoreAndReturn(cmock_retval) HAL_TIM_PWM_Start_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_PWM_Start_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_PWM_Start_DMA_StopIgnore() HAL_TIM_PWM_Start_DMA_CMockStopIgnore()
void HAL_TIM_PWM_Start_DMA_CMockStopIgnore(void);
#define HAL_TIM_PWM_Start_DMA_Expect(htim, Channel, pData, Length) TEST_FAIL_MESSAGE("HAL_TIM_PWM_Start_DMA requires _ExpectAndReturn");
#define HAL_TIM_PWM_Start_DMA_ExpectAndReturn(htim, Channel, pData, Length, cmock_retval) HAL_TIM_PWM_Start_DMA_CMockExpectAndReturn(__LINE__, htim, Channel, pData, Length, cmock_retval)
void HAL_TIM_PWM_Start_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t Channel, const uint32_t* pData, uint16_t Length, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_PWM_Start_DMA_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t Channel, const uint32_t* pData, uint16_t Length, int cmock_num_calls);
void HAL_TIM_PWM_Start_DMA_AddCallback(CMOCK_HAL_TIM_PWM_Start_DMA_CALLBACK Callback);
void HAL_TIM_PWM_Start_DMA_Stub(CMOCK_HAL_TIM_PWM_Start_DMA_CALLBACK Callback);
#define HAL_TIM_PWM_Start_DMA_StubWithCallback HAL_TIM_PWM_Start_DMA_Stub
#define HAL_TIM_PWM_Stop_DMA_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_PWM_Stop_DMA requires _IgnoreAndReturn");
#define HAL_TIM_PWM_Stop_DMA_IgnoreAndReturn(cmock_retval) HAL_TIM_PWM_Stop_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_PWM_Stop_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_PWM_Stop_DMA_StopIgnore() HAL_TIM_PWM_Stop_DMA_CMockStopIgnore()
void HAL_TIM_PWM_Stop_DMA_CMockStopIgnore(void);
#define HAL_TIM_PWM_Stop_DMA_Expect(htim, Channel) TEST_FAIL_MESSAGE("HAL_TIM_PWM_Stop_DMA requires _ExpectAndReturn");
#define HAL_TIM_PWM_Stop_DMA_ExpectAndReturn(htim, Channel, cmock_retval) HAL_TIM_PWM_Stop_DMA_CMockExpectAndReturn(__LINE__, htim, Channel, cmock_retval)
void HAL_TIM_PWM_Stop_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t Channel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_PWM_Stop_DMA_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t Channel, int cmock_num_calls);
void HAL_TIM_PWM_Stop_DMA_AddCallback(CMOCK_HAL_TIM_PWM_Stop_DMA_CALLBACK Callback);
void HAL_TIM_PWM_Stop_DMA_Stub(CMOCK_HAL_TIM_PWM_Stop_DMA_CALLBACK Callback);
#define HAL_TIM_PWM_Stop_DMA_StubWithCallback HAL_TIM_PWM_Stop_DMA_Stub
#define HAL_TIM_IC_Init_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_IC_Init requires _IgnoreAndReturn");
#define HAL_TIM_IC_Init_IgnoreAndReturn(cmock_retval) HAL_TIM_IC_Init_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_IC_Init_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_IC_Init_StopIgnore() HAL_TIM_IC_Init_CMockStopIgnore()
void HAL_TIM_IC_Init_CMockStopIgnore(void);
#define HAL_TIM_IC_Init_Expect(htim) TEST_FAIL_MESSAGE("HAL_TIM_IC_Init requires _ExpectAndReturn");
#define HAL_TIM_IC_Init_ExpectAndReturn(htim, cmock_retval) HAL_TIM_IC_Init_CMockExpectAndReturn(__LINE__, htim, cmock_retval)
void HAL_TIM_IC_Init_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_IC_Init_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_IC_Init_AddCallback(CMOCK_HAL_TIM_IC_Init_CALLBACK Callback);
void HAL_TIM_IC_Init_Stub(CMOCK_HAL_TIM_IC_Init_CALLBACK Callback);
#define HAL_TIM_IC_Init_StubWithCallback HAL_TIM_IC_Init_Stub
#define HAL_TIM_IC_DeInit_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_IC_DeInit requires _IgnoreAndReturn");
#define HAL_TIM_IC_DeInit_IgnoreAndReturn(cmock_retval) HAL_TIM_IC_DeInit_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_IC_DeInit_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_IC_DeInit_StopIgnore() HAL_TIM_IC_DeInit_CMockStopIgnore()
void HAL_TIM_IC_DeInit_CMockStopIgnore(void);
#define HAL_TIM_IC_DeInit_Expect(htim) TEST_FAIL_MESSAGE("HAL_TIM_IC_DeInit requires _ExpectAndReturn");
#define HAL_TIM_IC_DeInit_ExpectAndReturn(htim, cmock_retval) HAL_TIM_IC_DeInit_CMockExpectAndReturn(__LINE__, htim, cmock_retval)
void HAL_TIM_IC_DeInit_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_IC_DeInit_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_IC_DeInit_AddCallback(CMOCK_HAL_TIM_IC_DeInit_CALLBACK Callback);
void HAL_TIM_IC_DeInit_Stub(CMOCK_HAL_TIM_IC_DeInit_CALLBACK Callback);
#define HAL_TIM_IC_DeInit_StubWithCallback HAL_TIM_IC_DeInit_Stub
#define HAL_TIM_IC_MspInit_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_IC_MspInit requires _Ignore (not AndReturn)");
#define HAL_TIM_IC_MspInit_Ignore() HAL_TIM_IC_MspInit_CMockIgnore()
void HAL_TIM_IC_MspInit_CMockIgnore(void);
#define HAL_TIM_IC_MspInit_StopIgnore() HAL_TIM_IC_MspInit_CMockStopIgnore()
void HAL_TIM_IC_MspInit_CMockStopIgnore(void);
#define HAL_TIM_IC_MspInit_ExpectAndReturn(htim, cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_IC_MspInit requires _Expect (not AndReturn)");
#define HAL_TIM_IC_MspInit_Expect(htim) HAL_TIM_IC_MspInit_CMockExpect(__LINE__, htim)
void HAL_TIM_IC_MspInit_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim);
typedef void (* CMOCK_HAL_TIM_IC_MspInit_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_IC_MspInit_AddCallback(CMOCK_HAL_TIM_IC_MspInit_CALLBACK Callback);
void HAL_TIM_IC_MspInit_Stub(CMOCK_HAL_TIM_IC_MspInit_CALLBACK Callback);
#define HAL_TIM_IC_MspInit_StubWithCallback HAL_TIM_IC_MspInit_Stub
#define HAL_TIM_IC_MspDeInit_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_IC_MspDeInit requires _Ignore (not AndReturn)");
#define HAL_TIM_IC_MspDeInit_Ignore() HAL_TIM_IC_MspDeInit_CMockIgnore()
void HAL_TIM_IC_MspDeInit_CMockIgnore(void);
#define HAL_TIM_IC_MspDeInit_StopIgnore() HAL_TIM_IC_MspDeInit_CMockStopIgnore()
void HAL_TIM_IC_MspDeInit_CMockStopIgnore(void);
#define HAL_TIM_IC_MspDeInit_ExpectAndReturn(htim, cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_IC_MspDeInit requires _Expect (not AndReturn)");
#define HAL_TIM_IC_MspDeInit_Expect(htim) HAL_TIM_IC_MspDeInit_CMockExpect(__LINE__, htim)
void HAL_TIM_IC_MspDeInit_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim);
typedef void (* CMOCK_HAL_TIM_IC_MspDeInit_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_IC_MspDeInit_AddCallback(CMOCK_HAL_TIM_IC_MspDeInit_CALLBACK Callback);
void HAL_TIM_IC_MspDeInit_Stub(CMOCK_HAL_TIM_IC_MspDeInit_CALLBACK Callback);
#define HAL_TIM_IC_MspDeInit_StubWithCallback HAL_TIM_IC_MspDeInit_Stub
#define HAL_TIM_IC_Start_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_IC_Start requires _IgnoreAndReturn");
#define HAL_TIM_IC_Start_IgnoreAndReturn(cmock_retval) HAL_TIM_IC_Start_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_IC_Start_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_IC_Start_StopIgnore() HAL_TIM_IC_Start_CMockStopIgnore()
void HAL_TIM_IC_Start_CMockStopIgnore(void);
#define HAL_TIM_IC_Start_Expect(htim, Channel) TEST_FAIL_MESSAGE("HAL_TIM_IC_Start requires _ExpectAndReturn");
#define HAL_TIM_IC_Start_ExpectAndReturn(htim, Channel, cmock_retval) HAL_TIM_IC_Start_CMockExpectAndReturn(__LINE__, htim, Channel, cmock_retval)
void HAL_TIM_IC_Start_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t Channel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_IC_Start_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t Channel, int cmock_num_calls);
void HAL_TIM_IC_Start_AddCallback(CMOCK_HAL_TIM_IC_Start_CALLBACK Callback);
void HAL_TIM_IC_Start_Stub(CMOCK_HAL_TIM_IC_Start_CALLBACK Callback);
#define HAL_TIM_IC_Start_StubWithCallback HAL_TIM_IC_Start_Stub
#define HAL_TIM_IC_Stop_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_IC_Stop requires _IgnoreAndReturn");
#define HAL_TIM_IC_Stop_IgnoreAndReturn(cmock_retval) HAL_TIM_IC_Stop_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_IC_Stop_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_IC_Stop_StopIgnore() HAL_TIM_IC_Stop_CMockStopIgnore()
void HAL_TIM_IC_Stop_CMockStopIgnore(void);
#define HAL_TIM_IC_Stop_Expect(htim, Channel) TEST_FAIL_MESSAGE("HAL_TIM_IC_Stop requires _ExpectAndReturn");
#define HAL_TIM_IC_Stop_ExpectAndReturn(htim, Channel, cmock_retval) HAL_TIM_IC_Stop_CMockExpectAndReturn(__LINE__, htim, Channel, cmock_retval)
void HAL_TIM_IC_Stop_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t Channel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_IC_Stop_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t Channel, int cmock_num_calls);
void HAL_TIM_IC_Stop_AddCallback(CMOCK_HAL_TIM_IC_Stop_CALLBACK Callback);
void HAL_TIM_IC_Stop_Stub(CMOCK_HAL_TIM_IC_Stop_CALLBACK Callback);
#define HAL_TIM_IC_Stop_StubWithCallback HAL_TIM_IC_Stop_Stub
#define HAL_TIM_IC_Start_IT_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_IC_Start_IT requires _IgnoreAndReturn");
#define HAL_TIM_IC_Start_IT_IgnoreAndReturn(cmock_retval) HAL_TIM_IC_Start_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_IC_Start_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_IC_Start_IT_StopIgnore() HAL_TIM_IC_Start_IT_CMockStopIgnore()
void HAL_TIM_IC_Start_IT_CMockStopIgnore(void);
#define HAL_TIM_IC_Start_IT_Expect(htim, Channel) TEST_FAIL_MESSAGE("HAL_TIM_IC_Start_IT requires _ExpectAndReturn");
#define HAL_TIM_IC_Start_IT_ExpectAndReturn(htim, Channel, cmock_retval) HAL_TIM_IC_Start_IT_CMockExpectAndReturn(__LINE__, htim, Channel, cmock_retval)
void HAL_TIM_IC_Start_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t Channel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_IC_Start_IT_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t Channel, int cmock_num_calls);
void HAL_TIM_IC_Start_IT_AddCallback(CMOCK_HAL_TIM_IC_Start_IT_CALLBACK Callback);
void HAL_TIM_IC_Start_IT_Stub(CMOCK_HAL_TIM_IC_Start_IT_CALLBACK Callback);
#define HAL_TIM_IC_Start_IT_StubWithCallback HAL_TIM_IC_Start_IT_Stub
#define HAL_TIM_IC_Stop_IT_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_IC_Stop_IT requires _IgnoreAndReturn");
#define HAL_TIM_IC_Stop_IT_IgnoreAndReturn(cmock_retval) HAL_TIM_IC_Stop_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_IC_Stop_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_IC_Stop_IT_StopIgnore() HAL_TIM_IC_Stop_IT_CMockStopIgnore()
void HAL_TIM_IC_Stop_IT_CMockStopIgnore(void);
#define HAL_TIM_IC_Stop_IT_Expect(htim, Channel) TEST_FAIL_MESSAGE("HAL_TIM_IC_Stop_IT requires _ExpectAndReturn");
#define HAL_TIM_IC_Stop_IT_ExpectAndReturn(htim, Channel, cmock_retval) HAL_TIM_IC_Stop_IT_CMockExpectAndReturn(__LINE__, htim, Channel, cmock_retval)
void HAL_TIM_IC_Stop_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t Channel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_IC_Stop_IT_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t Channel, int cmock_num_calls);
void HAL_TIM_IC_Stop_IT_AddCallback(CMOCK_HAL_TIM_IC_Stop_IT_CALLBACK Callback);
void HAL_TIM_IC_Stop_IT_Stub(CMOCK_HAL_TIM_IC_Stop_IT_CALLBACK Callback);
#define HAL_TIM_IC_Stop_IT_StubWithCallback HAL_TIM_IC_Stop_IT_Stub
#define HAL_TIM_IC_Start_DMA_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_IC_Start_DMA requires _IgnoreAndReturn");
#define HAL_TIM_IC_Start_DMA_IgnoreAndReturn(cmock_retval) HAL_TIM_IC_Start_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_IC_Start_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_IC_Start_DMA_StopIgnore() HAL_TIM_IC_Start_DMA_CMockStopIgnore()
void HAL_TIM_IC_Start_DMA_CMockStopIgnore(void);
#define HAL_TIM_IC_Start_DMA_Expect(htim, Channel, pData, Length) TEST_FAIL_MESSAGE("HAL_TIM_IC_Start_DMA requires _ExpectAndReturn");
#define HAL_TIM_IC_Start_DMA_ExpectAndReturn(htim, Channel, pData, Length, cmock_retval) HAL_TIM_IC_Start_DMA_CMockExpectAndReturn(__LINE__, htim, Channel, pData, Length, cmock_retval)
void HAL_TIM_IC_Start_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t Channel, uint32_t* pData, uint16_t Length, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_IC_Start_DMA_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t Channel, uint32_t* pData, uint16_t Length, int cmock_num_calls);
void HAL_TIM_IC_Start_DMA_AddCallback(CMOCK_HAL_TIM_IC_Start_DMA_CALLBACK Callback);
void HAL_TIM_IC_Start_DMA_Stub(CMOCK_HAL_TIM_IC_Start_DMA_CALLBACK Callback);
#define HAL_TIM_IC_Start_DMA_StubWithCallback HAL_TIM_IC_Start_DMA_Stub
#define HAL_TIM_IC_Stop_DMA_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_IC_Stop_DMA requires _IgnoreAndReturn");
#define HAL_TIM_IC_Stop_DMA_IgnoreAndReturn(cmock_retval) HAL_TIM_IC_Stop_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_IC_Stop_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_IC_Stop_DMA_StopIgnore() HAL_TIM_IC_Stop_DMA_CMockStopIgnore()
void HAL_TIM_IC_Stop_DMA_CMockStopIgnore(void);
#define HAL_TIM_IC_Stop_DMA_Expect(htim, Channel) TEST_FAIL_MESSAGE("HAL_TIM_IC_Stop_DMA requires _ExpectAndReturn");
#define HAL_TIM_IC_Stop_DMA_ExpectAndReturn(htim, Channel, cmock_retval) HAL_TIM_IC_Stop_DMA_CMockExpectAndReturn(__LINE__, htim, Channel, cmock_retval)
void HAL_TIM_IC_Stop_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t Channel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_IC_Stop_DMA_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t Channel, int cmock_num_calls);
void HAL_TIM_IC_Stop_DMA_AddCallback(CMOCK_HAL_TIM_IC_Stop_DMA_CALLBACK Callback);
