chrydelezuch/3DPrinter/Tests/build/test/mocks/test_stepper_motor/mock_stm32f4xx_hal_tim.h
void HAL_TIM_IC_Stop_DMA_Stub(CMOCK_HAL_TIM_IC_Stop_DMA_CALLBACK Callback);
#define HAL_TIM_IC_Stop_DMA_StubWithCallback HAL_TIM_IC_Stop_DMA_Stub
#define HAL_TIM_OnePulse_Init_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_OnePulse_Init requires _IgnoreAndReturn");
#define HAL_TIM_OnePulse_Init_IgnoreAndReturn(cmock_retval) HAL_TIM_OnePulse_Init_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_OnePulse_Init_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_OnePulse_Init_StopIgnore() HAL_TIM_OnePulse_Init_CMockStopIgnore()
void HAL_TIM_OnePulse_Init_CMockStopIgnore(void);
#define HAL_TIM_OnePulse_Init_Expect(htim, OnePulseMode) TEST_FAIL_MESSAGE("HAL_TIM_OnePulse_Init requires _ExpectAndReturn");
#define HAL_TIM_OnePulse_Init_ExpectAndReturn(htim, OnePulseMode, cmock_retval) HAL_TIM_OnePulse_Init_CMockExpectAndReturn(__LINE__, htim, OnePulseMode, cmock_retval)
void HAL_TIM_OnePulse_Init_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t OnePulseMode, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_OnePulse_Init_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t OnePulseMode, int cmock_num_calls);
void HAL_TIM_OnePulse_Init_AddCallback(CMOCK_HAL_TIM_OnePulse_Init_CALLBACK Callback);
void HAL_TIM_OnePulse_Init_Stub(CMOCK_HAL_TIM_OnePulse_Init_CALLBACK Callback);
#define HAL_TIM_OnePulse_Init_StubWithCallback HAL_TIM_OnePulse_Init_Stub
#define HAL_TIM_OnePulse_DeInit_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_OnePulse_DeInit requires _IgnoreAndReturn");
#define HAL_TIM_OnePulse_DeInit_IgnoreAndReturn(cmock_retval) HAL_TIM_OnePulse_DeInit_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_OnePulse_DeInit_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_OnePulse_DeInit_StopIgnore() HAL_TIM_OnePulse_DeInit_CMockStopIgnore()
void HAL_TIM_OnePulse_DeInit_CMockStopIgnore(void);
#define HAL_TIM_OnePulse_DeInit_Expect(htim) TEST_FAIL_MESSAGE("HAL_TIM_OnePulse_DeInit requires _ExpectAndReturn");
#define HAL_TIM_OnePulse_DeInit_ExpectAndReturn(htim, cmock_retval) HAL_TIM_OnePulse_DeInit_CMockExpectAndReturn(__LINE__, htim, cmock_retval)
void HAL_TIM_OnePulse_DeInit_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_OnePulse_DeInit_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_OnePulse_DeInit_AddCallback(CMOCK_HAL_TIM_OnePulse_DeInit_CALLBACK Callback);
void HAL_TIM_OnePulse_DeInit_Stub(CMOCK_HAL_TIM_OnePulse_DeInit_CALLBACK Callback);
#define HAL_TIM_OnePulse_DeInit_StubWithCallback HAL_TIM_OnePulse_DeInit_Stub
#define HAL_TIM_OnePulse_MspInit_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_OnePulse_MspInit requires _Ignore (not AndReturn)");
#define HAL_TIM_OnePulse_MspInit_Ignore() HAL_TIM_OnePulse_MspInit_CMockIgnore()
void HAL_TIM_OnePulse_MspInit_CMockIgnore(void);
#define HAL_TIM_OnePulse_MspInit_StopIgnore() HAL_TIM_OnePulse_MspInit_CMockStopIgnore()
void HAL_TIM_OnePulse_MspInit_CMockStopIgnore(void);
#define HAL_TIM_OnePulse_MspInit_ExpectAndReturn(htim, cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_OnePulse_MspInit requires _Expect (not AndReturn)");
#define HAL_TIM_OnePulse_MspInit_Expect(htim) HAL_TIM_OnePulse_MspInit_CMockExpect(__LINE__, htim)
void HAL_TIM_OnePulse_MspInit_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim);
typedef void (* CMOCK_HAL_TIM_OnePulse_MspInit_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_OnePulse_MspInit_AddCallback(CMOCK_HAL_TIM_OnePulse_MspInit_CALLBACK Callback);
void HAL_TIM_OnePulse_MspInit_Stub(CMOCK_HAL_TIM_OnePulse_MspInit_CALLBACK Callback);
#define HAL_TIM_OnePulse_MspInit_StubWithCallback HAL_TIM_OnePulse_MspInit_Stub
#define HAL_TIM_OnePulse_MspDeInit_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_OnePulse_MspDeInit requires _Ignore (not AndReturn)");
#define HAL_TIM_OnePulse_MspDeInit_Ignore() HAL_TIM_OnePulse_MspDeInit_CMockIgnore()
void HAL_TIM_OnePulse_MspDeInit_CMockIgnore(void);
#define HAL_TIM_OnePulse_MspDeInit_StopIgnore() HAL_TIM_OnePulse_MspDeInit_CMockStopIgnore()
void HAL_TIM_OnePulse_MspDeInit_CMockStopIgnore(void);
#define HAL_TIM_OnePulse_MspDeInit_ExpectAndReturn(htim, cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_OnePulse_MspDeInit requires _Expect (not AndReturn)");
#define HAL_TIM_OnePulse_MspDeInit_Expect(htim) HAL_TIM_OnePulse_MspDeInit_CMockExpect(__LINE__, htim)
void HAL_TIM_OnePulse_MspDeInit_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim);
typedef void (* CMOCK_HAL_TIM_OnePulse_MspDeInit_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_OnePulse_MspDeInit_AddCallback(CMOCK_HAL_TIM_OnePulse_MspDeInit_CALLBACK Callback);
void HAL_TIM_OnePulse_MspDeInit_Stub(CMOCK_HAL_TIM_OnePulse_MspDeInit_CALLBACK Callback);
#define HAL_TIM_OnePulse_MspDeInit_StubWithCallback HAL_TIM_OnePulse_MspDeInit_Stub
#define HAL_TIM_OnePulse_Start_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_OnePulse_Start requires _IgnoreAndReturn");
#define HAL_TIM_OnePulse_Start_IgnoreAndReturn(cmock_retval) HAL_TIM_OnePulse_Start_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_OnePulse_Start_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_OnePulse_Start_StopIgnore() HAL_TIM_OnePulse_Start_CMockStopIgnore()
void HAL_TIM_OnePulse_Start_CMockStopIgnore(void);
#define HAL_TIM_OnePulse_Start_Expect(htim, OutputChannel) TEST_FAIL_MESSAGE("HAL_TIM_OnePulse_Start requires _ExpectAndReturn");
#define HAL_TIM_OnePulse_Start_ExpectAndReturn(htim, OutputChannel, cmock_retval) HAL_TIM_OnePulse_Start_CMockExpectAndReturn(__LINE__, htim, OutputChannel, cmock_retval)
void HAL_TIM_OnePulse_Start_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t OutputChannel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_OnePulse_Start_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t OutputChannel, int cmock_num_calls);
void HAL_TIM_OnePulse_Start_AddCallback(CMOCK_HAL_TIM_OnePulse_Start_CALLBACK Callback);
void HAL_TIM_OnePulse_Start_Stub(CMOCK_HAL_TIM_OnePulse_Start_CALLBACK Callback);
#define HAL_TIM_OnePulse_Start_StubWithCallback HAL_TIM_OnePulse_Start_Stub
#define HAL_TIM_OnePulse_Stop_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_OnePulse_Stop requires _IgnoreAndReturn");
#define HAL_TIM_OnePulse_Stop_IgnoreAndReturn(cmock_retval) HAL_TIM_OnePulse_Stop_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_OnePulse_Stop_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_OnePulse_Stop_StopIgnore() HAL_TIM_OnePulse_Stop_CMockStopIgnore()
void HAL_TIM_OnePulse_Stop_CMockStopIgnore(void);
#define HAL_TIM_OnePulse_Stop_Expect(htim, OutputChannel) TEST_FAIL_MESSAGE("HAL_TIM_OnePulse_Stop requires _ExpectAndReturn");
#define HAL_TIM_OnePulse_Stop_ExpectAndReturn(htim, OutputChannel, cmock_retval) HAL_TIM_OnePulse_Stop_CMockExpectAndReturn(__LINE__, htim, OutputChannel, cmock_retval)
void HAL_TIM_OnePulse_Stop_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t OutputChannel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_OnePulse_Stop_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t OutputChannel, int cmock_num_calls);
void HAL_TIM_OnePulse_Stop_AddCallback(CMOCK_HAL_TIM_OnePulse_Stop_CALLBACK Callback);
void HAL_TIM_OnePulse_Stop_Stub(CMOCK_HAL_TIM_OnePulse_Stop_CALLBACK Callback);
#define HAL_TIM_OnePulse_Stop_StubWithCallback HAL_TIM_OnePulse_Stop_Stub
#define HAL_TIM_OnePulse_Start_IT_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_OnePulse_Start_IT requires _IgnoreAndReturn");
#define HAL_TIM_OnePulse_Start_IT_IgnoreAndReturn(cmock_retval) HAL_TIM_OnePulse_Start_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_OnePulse_Start_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_OnePulse_Start_IT_StopIgnore() HAL_TIM_OnePulse_Start_IT_CMockStopIgnore()
void HAL_TIM_OnePulse_Start_IT_CMockStopIgnore(void);
#define HAL_TIM_OnePulse_Start_IT_Expect(htim, OutputChannel) TEST_FAIL_MESSAGE("HAL_TIM_OnePulse_Start_IT requires _ExpectAndReturn");
#define HAL_TIM_OnePulse_Start_IT_ExpectAndReturn(htim, OutputChannel, cmock_retval) HAL_TIM_OnePulse_Start_IT_CMockExpectAndReturn(__LINE__, htim, OutputChannel, cmock_retval)
void HAL_TIM_OnePulse_Start_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t OutputChannel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_OnePulse_Start_IT_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t OutputChannel, int cmock_num_calls);
void HAL_TIM_OnePulse_Start_IT_AddCallback(CMOCK_HAL_TIM_OnePulse_Start_IT_CALLBACK Callback);
void HAL_TIM_OnePulse_Start_IT_Stub(CMOCK_HAL_TIM_OnePulse_Start_IT_CALLBACK Callback);
#define HAL_TIM_OnePulse_Start_IT_StubWithCallback HAL_TIM_OnePulse_Start_IT_Stub
#define HAL_TIM_OnePulse_Stop_IT_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_OnePulse_Stop_IT requires _IgnoreAndReturn");
#define HAL_TIM_OnePulse_Stop_IT_IgnoreAndReturn(cmock_retval) HAL_TIM_OnePulse_Stop_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_OnePulse_Stop_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_OnePulse_Stop_IT_StopIgnore() HAL_TIM_OnePulse_Stop_IT_CMockStopIgnore()
void HAL_TIM_OnePulse_Stop_IT_CMockStopIgnore(void);
#define HAL_TIM_OnePulse_Stop_IT_Expect(htim, OutputChannel) TEST_FAIL_MESSAGE("HAL_TIM_OnePulse_Stop_IT requires _ExpectAndReturn");
#define HAL_TIM_OnePulse_Stop_IT_ExpectAndReturn(htim, OutputChannel, cmock_retval) HAL_TIM_OnePulse_Stop_IT_CMockExpectAndReturn(__LINE__, htim, OutputChannel, cmock_retval)
void HAL_TIM_OnePulse_Stop_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t OutputChannel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_OnePulse_Stop_IT_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t OutputChannel, int cmock_num_calls);
void HAL_TIM_OnePulse_Stop_IT_AddCallback(CMOCK_HAL_TIM_OnePulse_Stop_IT_CALLBACK Callback);
void HAL_TIM_OnePulse_Stop_IT_Stub(CMOCK_HAL_TIM_OnePulse_Stop_IT_CALLBACK Callback);
#define HAL_TIM_OnePulse_Stop_IT_StubWithCallback HAL_TIM_OnePulse_Stop_IT_Stub
#define HAL_TIM_Encoder_Init_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_Encoder_Init requires _IgnoreAndReturn");
#define HAL_TIM_Encoder_Init_IgnoreAndReturn(cmock_retval) HAL_TIM_Encoder_Init_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_Encoder_Init_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_Encoder_Init_StopIgnore() HAL_TIM_Encoder_Init_CMockStopIgnore()
void HAL_TIM_Encoder_Init_CMockStopIgnore(void);
#define HAL_TIM_Encoder_Init_Expect(htim, sConfig) TEST_FAIL_MESSAGE("HAL_TIM_Encoder_Init requires _ExpectAndReturn");
#define HAL_TIM_Encoder_Init_ExpectAndReturn(htim, sConfig, cmock_retval) HAL_TIM_Encoder_Init_CMockExpectAndReturn(__LINE__, htim, sConfig, cmock_retval)
void HAL_TIM_Encoder_Init_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, const TIM_Encoder_InitTypeDef* sConfig, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_Encoder_Init_CALLBACK)(TIM_HandleTypeDef* htim, const TIM_Encoder_InitTypeDef* sConfig, int cmock_num_calls);
void HAL_TIM_Encoder_Init_AddCallback(CMOCK_HAL_TIM_Encoder_Init_CALLBACK Callback);
void HAL_TIM_Encoder_Init_Stub(CMOCK_HAL_TIM_Encoder_Init_CALLBACK Callback);
#define HAL_TIM_Encoder_Init_StubWithCallback HAL_TIM_Encoder_Init_Stub
#define HAL_TIM_Encoder_DeInit_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_Encoder_DeInit requires _IgnoreAndReturn");
#define HAL_TIM_Encoder_DeInit_IgnoreAndReturn(cmock_retval) HAL_TIM_Encoder_DeInit_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_Encoder_DeInit_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_Encoder_DeInit_StopIgnore() HAL_TIM_Encoder_DeInit_CMockStopIgnore()
void HAL_TIM_Encoder_DeInit_CMockStopIgnore(void);
#define HAL_TIM_Encoder_DeInit_Expect(htim) TEST_FAIL_MESSAGE("HAL_TIM_Encoder_DeInit requires _ExpectAndReturn");
#define HAL_TIM_Encoder_DeInit_ExpectAndReturn(htim, cmock_retval) HAL_TIM_Encoder_DeInit_CMockExpectAndReturn(__LINE__, htim, cmock_retval)
void HAL_TIM_Encoder_DeInit_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_Encoder_DeInit_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_Encoder_DeInit_AddCallback(CMOCK_HAL_TIM_Encoder_DeInit_CALLBACK Callback);
void HAL_TIM_Encoder_DeInit_Stub(CMOCK_HAL_TIM_Encoder_DeInit_CALLBACK Callback);
#define HAL_TIM_Encoder_DeInit_StubWithCallback HAL_TIM_Encoder_DeInit_Stub
#define HAL_TIM_Encoder_MspInit_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_Encoder_MspInit requires _Ignore (not AndReturn)");
#define HAL_TIM_Encoder_MspInit_Ignore() HAL_TIM_Encoder_MspInit_CMockIgnore()
void HAL_TIM_Encoder_MspInit_CMockIgnore(void);
#define HAL_TIM_Encoder_MspInit_StopIgnore() HAL_TIM_Encoder_MspInit_CMockStopIgnore()
void HAL_TIM_Encoder_MspInit_CMockStopIgnore(void);
#define HAL_TIM_Encoder_MspInit_ExpectAndReturn(htim, cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_Encoder_MspInit requires _Expect (not AndReturn)");
#define HAL_TIM_Encoder_MspInit_Expect(htim) HAL_TIM_Encoder_MspInit_CMockExpect(__LINE__, htim)
void HAL_TIM_Encoder_MspInit_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim);
typedef void (* CMOCK_HAL_TIM_Encoder_MspInit_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_Encoder_MspInit_AddCallback(CMOCK_HAL_TIM_Encoder_MspInit_CALLBACK Callback);
void HAL_TIM_Encoder_MspInit_Stub(CMOCK_HAL_TIM_Encoder_MspInit_CALLBACK Callback);
#define HAL_TIM_Encoder_MspInit_StubWithCallback HAL_TIM_Encoder_MspInit_Stub
#define HAL_TIM_Encoder_MspDeInit_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_Encoder_MspDeInit requires _Ignore (not AndReturn)");
#define HAL_TIM_Encoder_MspDeInit_Ignore() HAL_TIM_Encoder_MspDeInit_CMockIgnore()
void HAL_TIM_Encoder_MspDeInit_CMockIgnore(void);
#define HAL_TIM_Encoder_MspDeInit_StopIgnore() HAL_TIM_Encoder_MspDeInit_CMockStopIgnore()
void HAL_TIM_Encoder_MspDeInit_CMockStopIgnore(void);
#define HAL_TIM_Encoder_MspDeInit_ExpectAndReturn(htim, cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_Encoder_MspDeInit requires _Expect (not AndReturn)");
#define HAL_TIM_Encoder_MspDeInit_Expect(htim) HAL_TIM_Encoder_MspDeInit_CMockExpect(__LINE__, htim)
void HAL_TIM_Encoder_MspDeInit_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim);
typedef void (* CMOCK_HAL_TIM_Encoder_MspDeInit_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_Encoder_MspDeInit_AddCallback(CMOCK_HAL_TIM_Encoder_MspDeInit_CALLBACK Callback);
void HAL_TIM_Encoder_MspDeInit_Stub(CMOCK_HAL_TIM_Encoder_MspDeInit_CALLBACK Callback);
#define HAL_TIM_Encoder_MspDeInit_StubWithCallback HAL_TIM_Encoder_MspDeInit_Stub
#define HAL_TIM_Encoder_Start_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_Encoder_Start requires _IgnoreAndReturn");
#define HAL_TIM_Encoder_Start_IgnoreAndReturn(cmock_retval) HAL_TIM_Encoder_Start_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_Encoder_Start_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_Encoder_Start_StopIgnore() HAL_TIM_Encoder_Start_CMockStopIgnore()
void HAL_TIM_Encoder_Start_CMockStopIgnore(void);
#define HAL_TIM_Encoder_Start_Expect(htim, Channel) TEST_FAIL_MESSAGE("HAL_TIM_Encoder_Start requires _ExpectAndReturn");
#define HAL_TIM_Encoder_Start_ExpectAndReturn(htim, Channel, cmock_retval) HAL_TIM_Encoder_Start_CMockExpectAndReturn(__LINE__, htim, Channel, cmock_retval)
void HAL_TIM_Encoder_Start_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t Channel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_Encoder_Start_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t Channel, int cmock_num_calls);
void HAL_TIM_Encoder_Start_AddCallback(CMOCK_HAL_TIM_Encoder_Start_CALLBACK Callback);
void HAL_TIM_Encoder_Start_Stub(CMOCK_HAL_TIM_Encoder_Start_CALLBACK Callback);
#define HAL_TIM_Encoder_Start_StubWithCallback HAL_TIM_Encoder_Start_Stub
#define HAL_TIM_Encoder_Stop_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_Encoder_Stop requires _IgnoreAndReturn");
#define HAL_TIM_Encoder_Stop_IgnoreAndReturn(cmock_retval) HAL_TIM_Encoder_Stop_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_Encoder_Stop_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_Encoder_Stop_StopIgnore() HAL_TIM_Encoder_Stop_CMockStopIgnore()
void HAL_TIM_Encoder_Stop_CMockStopIgnore(void);
#define HAL_TIM_Encoder_Stop_Expect(htim, Channel) TEST_FAIL_MESSAGE("HAL_TIM_Encoder_Stop requires _ExpectAndReturn");
#define HAL_TIM_Encoder_Stop_ExpectAndReturn(htim, Channel, cmock_retval) HAL_TIM_Encoder_Stop_CMockExpectAndReturn(__LINE__, htim, Channel, cmock_retval)
void HAL_TIM_Encoder_Stop_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t Channel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_Encoder_Stop_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t Channel, int cmock_num_calls);
void HAL_TIM_Encoder_Stop_AddCallback(CMOCK_HAL_TIM_Encoder_Stop_CALLBACK Callback);
void HAL_TIM_Encoder_Stop_Stub(CMOCK_HAL_TIM_Encoder_Stop_CALLBACK Callback);
#define HAL_TIM_Encoder_Stop_StubWithCallback HAL_TIM_Encoder_Stop_Stub
#define HAL_TIM_Encoder_Start_IT_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_Encoder_Start_IT requires _IgnoreAndReturn");
#define HAL_TIM_Encoder_Start_IT_IgnoreAndReturn(cmock_retval) HAL_TIM_Encoder_Start_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_Encoder_Start_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_Encoder_Start_IT_StopIgnore() HAL_TIM_Encoder_Start_IT_CMockStopIgnore()
void HAL_TIM_Encoder_Start_IT_CMockStopIgnore(void);
#define HAL_TIM_Encoder_Start_IT_Expect(htim, Channel) TEST_FAIL_MESSAGE("HAL_TIM_Encoder_Start_IT requires _ExpectAndReturn");
#define HAL_TIM_Encoder_Start_IT_ExpectAndReturn(htim, Channel, cmock_retval) HAL_TIM_Encoder_Start_IT_CMockExpectAndReturn(__LINE__, htim, Channel, cmock_retval)
void HAL_TIM_Encoder_Start_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t Channel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_Encoder_Start_IT_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t Channel, int cmock_num_calls);
void HAL_TIM_Encoder_Start_IT_AddCallback(CMOCK_HAL_TIM_Encoder_Start_IT_CALLBACK Callback);
void HAL_TIM_Encoder_Start_IT_Stub(CMOCK_HAL_TIM_Encoder_Start_IT_CALLBACK Callback);
#define HAL_TIM_Encoder_Start_IT_StubWithCallback HAL_TIM_Encoder_Start_IT_Stub
#define HAL_TIM_Encoder_Stop_IT_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_Encoder_Stop_IT requires _IgnoreAndReturn");
#define HAL_TIM_Encoder_Stop_IT_IgnoreAndReturn(cmock_retval) HAL_TIM_Encoder_Stop_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_Encoder_Stop_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_Encoder_Stop_IT_StopIgnore() HAL_TIM_Encoder_Stop_IT_CMockStopIgnore()
void HAL_TIM_Encoder_Stop_IT_CMockStopIgnore(void);
#define HAL_TIM_Encoder_Stop_IT_Expect(htim, Channel) TEST_FAIL_MESSAGE("HAL_TIM_Encoder_Stop_IT requires _ExpectAndReturn");
#define HAL_TIM_Encoder_Stop_IT_ExpectAndReturn(htim, Channel, cmock_retval) HAL_TIM_Encoder_Stop_IT_CMockExpectAndReturn(__LINE__, htim, Channel, cmock_retval)
void HAL_TIM_Encoder_Stop_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t Channel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_Encoder_Stop_IT_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t Channel, int cmock_num_calls);
void HAL_TIM_Encoder_Stop_IT_AddCallback(CMOCK_HAL_TIM_Encoder_Stop_IT_CALLBACK Callback);
void HAL_TIM_Encoder_Stop_IT_Stub(CMOCK_HAL_TIM_Encoder_Stop_IT_CALLBACK Callback);
#define HAL_TIM_Encoder_Stop_IT_StubWithCallback HAL_TIM_Encoder_Stop_IT_Stub
#define HAL_TIM_Encoder_Start_DMA_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_Encoder_Start_DMA requires _IgnoreAndReturn");
#define HAL_TIM_Encoder_Start_DMA_IgnoreAndReturn(cmock_retval) HAL_TIM_Encoder_Start_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_Encoder_Start_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_Encoder_Start_DMA_StopIgnore() HAL_TIM_Encoder_Start_DMA_CMockStopIgnore()
void HAL_TIM_Encoder_Start_DMA_CMockStopIgnore(void);
#define HAL_TIM_Encoder_Start_DMA_Expect(htim, Channel, pData1, pData2, Length) TEST_FAIL_MESSAGE("HAL_TIM_Encoder_Start_DMA requires _ExpectAndReturn");
#define HAL_TIM_Encoder_Start_DMA_ExpectAndReturn(htim, Channel, pData1, pData2, Length, cmock_retval) HAL_TIM_Encoder_Start_DMA_CMockExpectAndReturn(__LINE__, htim, Channel, pData1, pData2, Length, cmock_retval)
void HAL_TIM_Encoder_Start_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t Channel, uint32_t* pData1, uint32_t* pData2, uint16_t Length, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_Encoder_Start_DMA_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t Channel, uint32_t* pData1, uint32_t* pData2, uint16_t Length, int cmock_num_calls);
void HAL_TIM_Encoder_Start_DMA_AddCallback(CMOCK_HAL_TIM_Encoder_Start_DMA_CALLBACK Callback);
void HAL_TIM_Encoder_Start_DMA_Stub(CMOCK_HAL_TIM_Encoder_Start_DMA_CALLBACK Callback);
#define HAL_TIM_Encoder_Start_DMA_StubWithCallback HAL_TIM_Encoder_Start_DMA_Stub
#define HAL_TIM_Encoder_Stop_DMA_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_Encoder_Stop_DMA requires _IgnoreAndReturn");
#define HAL_TIM_Encoder_Stop_DMA_IgnoreAndReturn(cmock_retval) HAL_TIM_Encoder_Stop_DMA_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_Encoder_Stop_DMA_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_Encoder_Stop_DMA_StopIgnore() HAL_TIM_Encoder_Stop_DMA_CMockStopIgnore()
void HAL_TIM_Encoder_Stop_DMA_CMockStopIgnore(void);
#define HAL_TIM_Encoder_Stop_DMA_Expect(htim, Channel) TEST_FAIL_MESSAGE("HAL_TIM_Encoder_Stop_DMA requires _ExpectAndReturn");
#define HAL_TIM_Encoder_Stop_DMA_ExpectAndReturn(htim, Channel, cmock_retval) HAL_TIM_Encoder_Stop_DMA_CMockExpectAndReturn(__LINE__, htim, Channel, cmock_retval)
void HAL_TIM_Encoder_Stop_DMA_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t Channel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_Encoder_Stop_DMA_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t Channel, int cmock_num_calls);
void HAL_TIM_Encoder_Stop_DMA_AddCallback(CMOCK_HAL_TIM_Encoder_Stop_DMA_CALLBACK Callback);
void HAL_TIM_Encoder_Stop_DMA_Stub(CMOCK_HAL_TIM_Encoder_Stop_DMA_CALLBACK Callback);
#define HAL_TIM_Encoder_Stop_DMA_StubWithCallback HAL_TIM_Encoder_Stop_DMA_Stub
#define HAL_TIM_IRQHandler_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_IRQHandler requires _Ignore (not AndReturn)");
#define HAL_TIM_IRQHandler_Ignore() HAL_TIM_IRQHandler_CMockIgnore()
void HAL_TIM_IRQHandler_CMockIgnore(void);
#define HAL_TIM_IRQHandler_StopIgnore() HAL_TIM_IRQHandler_CMockStopIgnore()
void HAL_TIM_IRQHandler_CMockStopIgnore(void);
#define HAL_TIM_IRQHandler_ExpectAndReturn(htim, cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_IRQHandler requires _Expect (not AndReturn)");
#define HAL_TIM_IRQHandler_Expect(htim) HAL_TIM_IRQHandler_CMockExpect(__LINE__, htim)
