chrydelezuch/3DPrinter/Tests/build/test/mocks/test_stepper_motor/mock_stm32f4xx_hal_tim.h
void HAL_TIM_IRQHandler_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim);
typedef void (* CMOCK_HAL_TIM_IRQHandler_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_IRQHandler_AddCallback(CMOCK_HAL_TIM_IRQHandler_CALLBACK Callback);
void HAL_TIM_IRQHandler_Stub(CMOCK_HAL_TIM_IRQHandler_CALLBACK Callback);
#define HAL_TIM_IRQHandler_StubWithCallback HAL_TIM_IRQHandler_Stub
#define HAL_TIM_OC_ConfigChannel_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_OC_ConfigChannel requires _IgnoreAndReturn");
#define HAL_TIM_OC_ConfigChannel_IgnoreAndReturn(cmock_retval) HAL_TIM_OC_ConfigChannel_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_OC_ConfigChannel_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_OC_ConfigChannel_StopIgnore() HAL_TIM_OC_ConfigChannel_CMockStopIgnore()
void HAL_TIM_OC_ConfigChannel_CMockStopIgnore(void);
#define HAL_TIM_OC_ConfigChannel_Expect(htim, sConfig, Channel) TEST_FAIL_MESSAGE("HAL_TIM_OC_ConfigChannel requires _ExpectAndReturn");
#define HAL_TIM_OC_ConfigChannel_ExpectAndReturn(htim, sConfig, Channel, cmock_retval) HAL_TIM_OC_ConfigChannel_CMockExpectAndReturn(__LINE__, htim, sConfig, Channel, cmock_retval)
void HAL_TIM_OC_ConfigChannel_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, const TIM_OC_InitTypeDef* sConfig, uint32_t Channel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_OC_ConfigChannel_CALLBACK)(TIM_HandleTypeDef* htim, const TIM_OC_InitTypeDef* sConfig, uint32_t Channel, int cmock_num_calls);
void HAL_TIM_OC_ConfigChannel_AddCallback(CMOCK_HAL_TIM_OC_ConfigChannel_CALLBACK Callback);
void HAL_TIM_OC_ConfigChannel_Stub(CMOCK_HAL_TIM_OC_ConfigChannel_CALLBACK Callback);
#define HAL_TIM_OC_ConfigChannel_StubWithCallback HAL_TIM_OC_ConfigChannel_Stub
#define HAL_TIM_PWM_ConfigChannel_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_PWM_ConfigChannel requires _IgnoreAndReturn");
#define HAL_TIM_PWM_ConfigChannel_IgnoreAndReturn(cmock_retval) HAL_TIM_PWM_ConfigChannel_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_PWM_ConfigChannel_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_PWM_ConfigChannel_StopIgnore() HAL_TIM_PWM_ConfigChannel_CMockStopIgnore()
void HAL_TIM_PWM_ConfigChannel_CMockStopIgnore(void);
#define HAL_TIM_PWM_ConfigChannel_Expect(htim, sConfig, Channel) TEST_FAIL_MESSAGE("HAL_TIM_PWM_ConfigChannel requires _ExpectAndReturn");
#define HAL_TIM_PWM_ConfigChannel_ExpectAndReturn(htim, sConfig, Channel, cmock_retval) HAL_TIM_PWM_ConfigChannel_CMockExpectAndReturn(__LINE__, htim, sConfig, Channel, cmock_retval)
void HAL_TIM_PWM_ConfigChannel_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, const TIM_OC_InitTypeDef* sConfig, uint32_t Channel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_PWM_ConfigChannel_CALLBACK)(TIM_HandleTypeDef* htim, const TIM_OC_InitTypeDef* sConfig, uint32_t Channel, int cmock_num_calls);
void HAL_TIM_PWM_ConfigChannel_AddCallback(CMOCK_HAL_TIM_PWM_ConfigChannel_CALLBACK Callback);
void HAL_TIM_PWM_ConfigChannel_Stub(CMOCK_HAL_TIM_PWM_ConfigChannel_CALLBACK Callback);
#define HAL_TIM_PWM_ConfigChannel_StubWithCallback HAL_TIM_PWM_ConfigChannel_Stub
#define HAL_TIM_IC_ConfigChannel_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_IC_ConfigChannel requires _IgnoreAndReturn");
#define HAL_TIM_IC_ConfigChannel_IgnoreAndReturn(cmock_retval) HAL_TIM_IC_ConfigChannel_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_IC_ConfigChannel_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_IC_ConfigChannel_StopIgnore() HAL_TIM_IC_ConfigChannel_CMockStopIgnore()
void HAL_TIM_IC_ConfigChannel_CMockStopIgnore(void);
#define HAL_TIM_IC_ConfigChannel_Expect(htim, sConfig, Channel) TEST_FAIL_MESSAGE("HAL_TIM_IC_ConfigChannel requires _ExpectAndReturn");
#define HAL_TIM_IC_ConfigChannel_ExpectAndReturn(htim, sConfig, Channel, cmock_retval) HAL_TIM_IC_ConfigChannel_CMockExpectAndReturn(__LINE__, htim, sConfig, Channel, cmock_retval)
void HAL_TIM_IC_ConfigChannel_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, const TIM_IC_InitTypeDef* sConfig, uint32_t Channel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_IC_ConfigChannel_CALLBACK)(TIM_HandleTypeDef* htim, const TIM_IC_InitTypeDef* sConfig, uint32_t Channel, int cmock_num_calls);
void HAL_TIM_IC_ConfigChannel_AddCallback(CMOCK_HAL_TIM_IC_ConfigChannel_CALLBACK Callback);
void HAL_TIM_IC_ConfigChannel_Stub(CMOCK_HAL_TIM_IC_ConfigChannel_CALLBACK Callback);
#define HAL_TIM_IC_ConfigChannel_StubWithCallback HAL_TIM_IC_ConfigChannel_Stub
#define HAL_TIM_OnePulse_ConfigChannel_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_OnePulse_ConfigChannel requires _IgnoreAndReturn");
#define HAL_TIM_OnePulse_ConfigChannel_IgnoreAndReturn(cmock_retval) HAL_TIM_OnePulse_ConfigChannel_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_OnePulse_ConfigChannel_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_OnePulse_ConfigChannel_StopIgnore() HAL_TIM_OnePulse_ConfigChannel_CMockStopIgnore()
void HAL_TIM_OnePulse_ConfigChannel_CMockStopIgnore(void);
#define HAL_TIM_OnePulse_ConfigChannel_Expect(htim, sConfig, OutputChannel, InputChannel) TEST_FAIL_MESSAGE("HAL_TIM_OnePulse_ConfigChannel requires _ExpectAndReturn");
#define HAL_TIM_OnePulse_ConfigChannel_ExpectAndReturn(htim, sConfig, OutputChannel, InputChannel, cmock_retval) HAL_TIM_OnePulse_ConfigChannel_CMockExpectAndReturn(__LINE__, htim, sConfig, OutputChannel, InputChannel, cmock_retval)
void HAL_TIM_OnePulse_ConfigChannel_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, TIM_OnePulse_InitTypeDef* sConfig, uint32_t OutputChannel, uint32_t InputChannel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_OnePulse_ConfigChannel_CALLBACK)(TIM_HandleTypeDef* htim, TIM_OnePulse_InitTypeDef* sConfig, uint32_t OutputChannel, uint32_t InputChannel, int cmock_num_calls);
void HAL_TIM_OnePulse_ConfigChannel_AddCallback(CMOCK_HAL_TIM_OnePulse_ConfigChannel_CALLBACK Callback);
void HAL_TIM_OnePulse_ConfigChannel_Stub(CMOCK_HAL_TIM_OnePulse_ConfigChannel_CALLBACK Callback);
#define HAL_TIM_OnePulse_ConfigChannel_StubWithCallback HAL_TIM_OnePulse_ConfigChannel_Stub
#define HAL_TIM_ConfigOCrefClear_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_ConfigOCrefClear requires _IgnoreAndReturn");
#define HAL_TIM_ConfigOCrefClear_IgnoreAndReturn(cmock_retval) HAL_TIM_ConfigOCrefClear_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_ConfigOCrefClear_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_ConfigOCrefClear_StopIgnore() HAL_TIM_ConfigOCrefClear_CMockStopIgnore()
void HAL_TIM_ConfigOCrefClear_CMockStopIgnore(void);
#define HAL_TIM_ConfigOCrefClear_Expect(htim, sClearInputConfig, Channel) TEST_FAIL_MESSAGE("HAL_TIM_ConfigOCrefClear requires _ExpectAndReturn");
#define HAL_TIM_ConfigOCrefClear_ExpectAndReturn(htim, sClearInputConfig, Channel, cmock_retval) HAL_TIM_ConfigOCrefClear_CMockExpectAndReturn(__LINE__, htim, sClearInputConfig, Channel, cmock_retval)
void HAL_TIM_ConfigOCrefClear_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, const TIM_ClearInputConfigTypeDef* sClearInputConfig, uint32_t Channel, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_ConfigOCrefClear_CALLBACK)(TIM_HandleTypeDef* htim, const TIM_ClearInputConfigTypeDef* sClearInputConfig, uint32_t Channel, int cmock_num_calls);
void HAL_TIM_ConfigOCrefClear_AddCallback(CMOCK_HAL_TIM_ConfigOCrefClear_CALLBACK Callback);
void HAL_TIM_ConfigOCrefClear_Stub(CMOCK_HAL_TIM_ConfigOCrefClear_CALLBACK Callback);
#define HAL_TIM_ConfigOCrefClear_StubWithCallback HAL_TIM_ConfigOCrefClear_Stub
#define HAL_TIM_ConfigClockSource_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_ConfigClockSource requires _IgnoreAndReturn");
#define HAL_TIM_ConfigClockSource_IgnoreAndReturn(cmock_retval) HAL_TIM_ConfigClockSource_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_ConfigClockSource_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_ConfigClockSource_StopIgnore() HAL_TIM_ConfigClockSource_CMockStopIgnore()
void HAL_TIM_ConfigClockSource_CMockStopIgnore(void);
#define HAL_TIM_ConfigClockSource_Expect(htim, sClockSourceConfig) TEST_FAIL_MESSAGE("HAL_TIM_ConfigClockSource requires _ExpectAndReturn");
#define HAL_TIM_ConfigClockSource_ExpectAndReturn(htim, sClockSourceConfig, cmock_retval) HAL_TIM_ConfigClockSource_CMockExpectAndReturn(__LINE__, htim, sClockSourceConfig, cmock_retval)
void HAL_TIM_ConfigClockSource_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, const TIM_ClockConfigTypeDef* sClockSourceConfig, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_ConfigClockSource_CALLBACK)(TIM_HandleTypeDef* htim, const TIM_ClockConfigTypeDef* sClockSourceConfig, int cmock_num_calls);
void HAL_TIM_ConfigClockSource_AddCallback(CMOCK_HAL_TIM_ConfigClockSource_CALLBACK Callback);
void HAL_TIM_ConfigClockSource_Stub(CMOCK_HAL_TIM_ConfigClockSource_CALLBACK Callback);
#define HAL_TIM_ConfigClockSource_StubWithCallback HAL_TIM_ConfigClockSource_Stub
#define HAL_TIM_ConfigTI1Input_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_ConfigTI1Input requires _IgnoreAndReturn");
#define HAL_TIM_ConfigTI1Input_IgnoreAndReturn(cmock_retval) HAL_TIM_ConfigTI1Input_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_ConfigTI1Input_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_ConfigTI1Input_StopIgnore() HAL_TIM_ConfigTI1Input_CMockStopIgnore()
void HAL_TIM_ConfigTI1Input_CMockStopIgnore(void);
#define HAL_TIM_ConfigTI1Input_Expect(htim, TI1_Selection) TEST_FAIL_MESSAGE("HAL_TIM_ConfigTI1Input requires _ExpectAndReturn");
#define HAL_TIM_ConfigTI1Input_ExpectAndReturn(htim, TI1_Selection, cmock_retval) HAL_TIM_ConfigTI1Input_CMockExpectAndReturn(__LINE__, htim, TI1_Selection, cmock_retval)
void HAL_TIM_ConfigTI1Input_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t TI1_Selection, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_ConfigTI1Input_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t TI1_Selection, int cmock_num_calls);
void HAL_TIM_ConfigTI1Input_AddCallback(CMOCK_HAL_TIM_ConfigTI1Input_CALLBACK Callback);
void HAL_TIM_ConfigTI1Input_Stub(CMOCK_HAL_TIM_ConfigTI1Input_CALLBACK Callback);
#define HAL_TIM_ConfigTI1Input_StubWithCallback HAL_TIM_ConfigTI1Input_Stub
#define HAL_TIM_SlaveConfigSynchro_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_SlaveConfigSynchro requires _IgnoreAndReturn");
#define HAL_TIM_SlaveConfigSynchro_IgnoreAndReturn(cmock_retval) HAL_TIM_SlaveConfigSynchro_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_SlaveConfigSynchro_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_SlaveConfigSynchro_StopIgnore() HAL_TIM_SlaveConfigSynchro_CMockStopIgnore()
void HAL_TIM_SlaveConfigSynchro_CMockStopIgnore(void);
#define HAL_TIM_SlaveConfigSynchro_Expect(htim, sSlaveConfig) TEST_FAIL_MESSAGE("HAL_TIM_SlaveConfigSynchro requires _ExpectAndReturn");
#define HAL_TIM_SlaveConfigSynchro_ExpectAndReturn(htim, sSlaveConfig, cmock_retval) HAL_TIM_SlaveConfigSynchro_CMockExpectAndReturn(__LINE__, htim, sSlaveConfig, cmock_retval)
void HAL_TIM_SlaveConfigSynchro_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, const TIM_SlaveConfigTypeDef* sSlaveConfig, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_SlaveConfigSynchro_CALLBACK)(TIM_HandleTypeDef* htim, const TIM_SlaveConfigTypeDef* sSlaveConfig, int cmock_num_calls);
void HAL_TIM_SlaveConfigSynchro_AddCallback(CMOCK_HAL_TIM_SlaveConfigSynchro_CALLBACK Callback);
void HAL_TIM_SlaveConfigSynchro_Stub(CMOCK_HAL_TIM_SlaveConfigSynchro_CALLBACK Callback);
#define HAL_TIM_SlaveConfigSynchro_StubWithCallback HAL_TIM_SlaveConfigSynchro_Stub
#define HAL_TIM_SlaveConfigSynchro_IT_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_SlaveConfigSynchro_IT requires _IgnoreAndReturn");
#define HAL_TIM_SlaveConfigSynchro_IT_IgnoreAndReturn(cmock_retval) HAL_TIM_SlaveConfigSynchro_IT_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_SlaveConfigSynchro_IT_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_SlaveConfigSynchro_IT_StopIgnore() HAL_TIM_SlaveConfigSynchro_IT_CMockStopIgnore()
void HAL_TIM_SlaveConfigSynchro_IT_CMockStopIgnore(void);
#define HAL_TIM_SlaveConfigSynchro_IT_Expect(htim, sSlaveConfig) TEST_FAIL_MESSAGE("HAL_TIM_SlaveConfigSynchro_IT requires _ExpectAndReturn");
#define HAL_TIM_SlaveConfigSynchro_IT_ExpectAndReturn(htim, sSlaveConfig, cmock_retval) HAL_TIM_SlaveConfigSynchro_IT_CMockExpectAndReturn(__LINE__, htim, sSlaveConfig, cmock_retval)
void HAL_TIM_SlaveConfigSynchro_IT_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, const TIM_SlaveConfigTypeDef* sSlaveConfig, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_SlaveConfigSynchro_IT_CALLBACK)(TIM_HandleTypeDef* htim, const TIM_SlaveConfigTypeDef* sSlaveConfig, int cmock_num_calls);
void HAL_TIM_SlaveConfigSynchro_IT_AddCallback(CMOCK_HAL_TIM_SlaveConfigSynchro_IT_CALLBACK Callback);
void HAL_TIM_SlaveConfigSynchro_IT_Stub(CMOCK_HAL_TIM_SlaveConfigSynchro_IT_CALLBACK Callback);
#define HAL_TIM_SlaveConfigSynchro_IT_StubWithCallback HAL_TIM_SlaveConfigSynchro_IT_Stub
#define HAL_TIM_DMABurst_WriteStart_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_DMABurst_WriteStart requires _IgnoreAndReturn");
#define HAL_TIM_DMABurst_WriteStart_IgnoreAndReturn(cmock_retval) HAL_TIM_DMABurst_WriteStart_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_DMABurst_WriteStart_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_DMABurst_WriteStart_StopIgnore() HAL_TIM_DMABurst_WriteStart_CMockStopIgnore()
void HAL_TIM_DMABurst_WriteStart_CMockStopIgnore(void);
#define HAL_TIM_DMABurst_WriteStart_Expect(htim, BurstBaseAddress, BurstRequestSrc, BurstBuffer, BurstLength) TEST_FAIL_MESSAGE("HAL_TIM_DMABurst_WriteStart requires _ExpectAndReturn");
#define HAL_TIM_DMABurst_WriteStart_ExpectAndReturn(htim, BurstBaseAddress, BurstRequestSrc, BurstBuffer, BurstLength, cmock_retval) HAL_TIM_DMABurst_WriteStart_CMockExpectAndReturn(__LINE__, htim, BurstBaseAddress, BurstRequestSrc, BurstBuffer, BurstLength, cmock_retval)
void HAL_TIM_DMABurst_WriteStart_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t BurstBaseAddress, uint32_t BurstRequestSrc, const uint32_t* BurstBuffer, uint32_t BurstLength, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_DMABurst_WriteStart_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t BurstBaseAddress, uint32_t BurstRequestSrc, const uint32_t* BurstBuffer, uint32_t BurstLength, int cmock_num_calls);
void HAL_TIM_DMABurst_WriteStart_AddCallback(CMOCK_HAL_TIM_DMABurst_WriteStart_CALLBACK Callback);
void HAL_TIM_DMABurst_WriteStart_Stub(CMOCK_HAL_TIM_DMABurst_WriteStart_CALLBACK Callback);
#define HAL_TIM_DMABurst_WriteStart_StubWithCallback HAL_TIM_DMABurst_WriteStart_Stub
#define HAL_TIM_DMABurst_MultiWriteStart_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_DMABurst_MultiWriteStart requires _IgnoreAndReturn");
#define HAL_TIM_DMABurst_MultiWriteStart_IgnoreAndReturn(cmock_retval) HAL_TIM_DMABurst_MultiWriteStart_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_DMABurst_MultiWriteStart_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_DMABurst_MultiWriteStart_StopIgnore() HAL_TIM_DMABurst_MultiWriteStart_CMockStopIgnore()
void HAL_TIM_DMABurst_MultiWriteStart_CMockStopIgnore(void);
#define HAL_TIM_DMABurst_MultiWriteStart_Expect(htim, BurstBaseAddress, BurstRequestSrc, BurstBuffer, BurstLength, DataLength) TEST_FAIL_MESSAGE("HAL_TIM_DMABurst_MultiWriteStart requires _ExpectAndReturn");
#define HAL_TIM_DMABurst_MultiWriteStart_ExpectAndReturn(htim, BurstBaseAddress, BurstRequestSrc, BurstBuffer, BurstLength, DataLength, cmock_retval) HAL_TIM_DMABurst_MultiWriteStart_CMockExpectAndReturn(__LINE__, htim, BurstBaseAddress, BurstRequestSrc, BurstBuffer, BurstLength, DataLength, cmock_retval)
void HAL_TIM_DMABurst_MultiWriteStart_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t BurstBaseAddress, uint32_t BurstRequestSrc, const uint32_t* BurstBuffer, uint32_t BurstLength, uint32_t DataLength, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_DMABurst_MultiWriteStart_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t BurstBaseAddress, uint32_t BurstRequestSrc, const uint32_t* BurstBuffer, uint32_t BurstLength, uint32_t DataLength, int cmock_num_calls);
void HAL_TIM_DMABurst_MultiWriteStart_AddCallback(CMOCK_HAL_TIM_DMABurst_MultiWriteStart_CALLBACK Callback);
void HAL_TIM_DMABurst_MultiWriteStart_Stub(CMOCK_HAL_TIM_DMABurst_MultiWriteStart_CALLBACK Callback);
#define HAL_TIM_DMABurst_MultiWriteStart_StubWithCallback HAL_TIM_DMABurst_MultiWriteStart_Stub
#define HAL_TIM_DMABurst_WriteStop_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_DMABurst_WriteStop requires _IgnoreAndReturn");
#define HAL_TIM_DMABurst_WriteStop_IgnoreAndReturn(cmock_retval) HAL_TIM_DMABurst_WriteStop_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_DMABurst_WriteStop_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_DMABurst_WriteStop_StopIgnore() HAL_TIM_DMABurst_WriteStop_CMockStopIgnore()
void HAL_TIM_DMABurst_WriteStop_CMockStopIgnore(void);
#define HAL_TIM_DMABurst_WriteStop_Expect(htim, BurstRequestSrc) TEST_FAIL_MESSAGE("HAL_TIM_DMABurst_WriteStop requires _ExpectAndReturn");
#define HAL_TIM_DMABurst_WriteStop_ExpectAndReturn(htim, BurstRequestSrc, cmock_retval) HAL_TIM_DMABurst_WriteStop_CMockExpectAndReturn(__LINE__, htim, BurstRequestSrc, cmock_retval)
void HAL_TIM_DMABurst_WriteStop_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t BurstRequestSrc, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_DMABurst_WriteStop_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t BurstRequestSrc, int cmock_num_calls);
void HAL_TIM_DMABurst_WriteStop_AddCallback(CMOCK_HAL_TIM_DMABurst_WriteStop_CALLBACK Callback);
void HAL_TIM_DMABurst_WriteStop_Stub(CMOCK_HAL_TIM_DMABurst_WriteStop_CALLBACK Callback);
#define HAL_TIM_DMABurst_WriteStop_StubWithCallback HAL_TIM_DMABurst_WriteStop_Stub
#define HAL_TIM_DMABurst_ReadStart_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_DMABurst_ReadStart requires _IgnoreAndReturn");
#define HAL_TIM_DMABurst_ReadStart_IgnoreAndReturn(cmock_retval) HAL_TIM_DMABurst_ReadStart_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_DMABurst_ReadStart_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_DMABurst_ReadStart_StopIgnore() HAL_TIM_DMABurst_ReadStart_CMockStopIgnore()
void HAL_TIM_DMABurst_ReadStart_CMockStopIgnore(void);
#define HAL_TIM_DMABurst_ReadStart_Expect(htim, BurstBaseAddress, BurstRequestSrc, BurstBuffer, BurstLength) TEST_FAIL_MESSAGE("HAL_TIM_DMABurst_ReadStart requires _ExpectAndReturn");
#define HAL_TIM_DMABurst_ReadStart_ExpectAndReturn(htim, BurstBaseAddress, BurstRequestSrc, BurstBuffer, BurstLength, cmock_retval) HAL_TIM_DMABurst_ReadStart_CMockExpectAndReturn(__LINE__, htim, BurstBaseAddress, BurstRequestSrc, BurstBuffer, BurstLength, cmock_retval)
void HAL_TIM_DMABurst_ReadStart_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t BurstBaseAddress, uint32_t BurstRequestSrc, uint32_t* BurstBuffer, uint32_t BurstLength, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_DMABurst_ReadStart_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t BurstBaseAddress, uint32_t BurstRequestSrc, uint32_t* BurstBuffer, uint32_t BurstLength, int cmock_num_calls);
void HAL_TIM_DMABurst_ReadStart_AddCallback(CMOCK_HAL_TIM_DMABurst_ReadStart_CALLBACK Callback);
void HAL_TIM_DMABurst_ReadStart_Stub(CMOCK_HAL_TIM_DMABurst_ReadStart_CALLBACK Callback);
#define HAL_TIM_DMABurst_ReadStart_StubWithCallback HAL_TIM_DMABurst_ReadStart_Stub
#define HAL_TIM_DMABurst_MultiReadStart_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_DMABurst_MultiReadStart requires _IgnoreAndReturn");
#define HAL_TIM_DMABurst_MultiReadStart_IgnoreAndReturn(cmock_retval) HAL_TIM_DMABurst_MultiReadStart_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_DMABurst_MultiReadStart_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_DMABurst_MultiReadStart_StopIgnore() HAL_TIM_DMABurst_MultiReadStart_CMockStopIgnore()
void HAL_TIM_DMABurst_MultiReadStart_CMockStopIgnore(void);
#define HAL_TIM_DMABurst_MultiReadStart_Expect(htim, BurstBaseAddress, BurstRequestSrc, BurstBuffer, BurstLength, DataLength) TEST_FAIL_MESSAGE("HAL_TIM_DMABurst_MultiReadStart requires _ExpectAndReturn");
#define HAL_TIM_DMABurst_MultiReadStart_ExpectAndReturn(htim, BurstBaseAddress, BurstRequestSrc, BurstBuffer, BurstLength, DataLength, cmock_retval) HAL_TIM_DMABurst_MultiReadStart_CMockExpectAndReturn(__LINE__, htim, BurstBaseAddress, BurstRequestSrc, BurstBuffer, BurstLength, DataLength, cmock_retval)
void HAL_TIM_DMABurst_MultiReadStart_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t BurstBaseAddress, uint32_t BurstRequestSrc, uint32_t* BurstBuffer, uint32_t BurstLength, uint32_t DataLength, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_DMABurst_MultiReadStart_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t BurstBaseAddress, uint32_t BurstRequestSrc, uint32_t* BurstBuffer, uint32_t BurstLength, uint32_t DataLength, int cmock_num_calls);
void HAL_TIM_DMABurst_MultiReadStart_AddCallback(CMOCK_HAL_TIM_DMABurst_MultiReadStart_CALLBACK Callback);
void HAL_TIM_DMABurst_MultiReadStart_Stub(CMOCK_HAL_TIM_DMABurst_MultiReadStart_CALLBACK Callback);
#define HAL_TIM_DMABurst_MultiReadStart_StubWithCallback HAL_TIM_DMABurst_MultiReadStart_Stub
#define HAL_TIM_DMABurst_ReadStop_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_DMABurst_ReadStop requires _IgnoreAndReturn");
#define HAL_TIM_DMABurst_ReadStop_IgnoreAndReturn(cmock_retval) HAL_TIM_DMABurst_ReadStop_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_DMABurst_ReadStop_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_DMABurst_ReadStop_StopIgnore() HAL_TIM_DMABurst_ReadStop_CMockStopIgnore()
void HAL_TIM_DMABurst_ReadStop_CMockStopIgnore(void);
#define HAL_TIM_DMABurst_ReadStop_Expect(htim, BurstRequestSrc) TEST_FAIL_MESSAGE("HAL_TIM_DMABurst_ReadStop requires _ExpectAndReturn");
#define HAL_TIM_DMABurst_ReadStop_ExpectAndReturn(htim, BurstRequestSrc, cmock_retval) HAL_TIM_DMABurst_ReadStop_CMockExpectAndReturn(__LINE__, htim, BurstRequestSrc, cmock_retval)
void HAL_TIM_DMABurst_ReadStop_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t BurstRequestSrc, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_DMABurst_ReadStop_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t BurstRequestSrc, int cmock_num_calls);
void HAL_TIM_DMABurst_ReadStop_AddCallback(CMOCK_HAL_TIM_DMABurst_ReadStop_CALLBACK Callback);
void HAL_TIM_DMABurst_ReadStop_Stub(CMOCK_HAL_TIM_DMABurst_ReadStop_CALLBACK Callback);
#define HAL_TIM_DMABurst_ReadStop_StubWithCallback HAL_TIM_DMABurst_ReadStop_Stub
#define HAL_TIM_GenerateEvent_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_GenerateEvent requires _IgnoreAndReturn");
