chrydelezuch/3DPrinter/Tests/build/test/mocks/test_stepper_motor/mock_stm32f4xx_hal_tim.h
#define HAL_TIM_GenerateEvent_IgnoreAndReturn(cmock_retval) HAL_TIM_GenerateEvent_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_GenerateEvent_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_GenerateEvent_StopIgnore() HAL_TIM_GenerateEvent_CMockStopIgnore()
void HAL_TIM_GenerateEvent_CMockStopIgnore(void);
#define HAL_TIM_GenerateEvent_Expect(htim, EventSource) TEST_FAIL_MESSAGE("HAL_TIM_GenerateEvent requires _ExpectAndReturn");
#define HAL_TIM_GenerateEvent_ExpectAndReturn(htim, EventSource, cmock_retval) HAL_TIM_GenerateEvent_CMockExpectAndReturn(__LINE__, htim, EventSource, cmock_retval)
void HAL_TIM_GenerateEvent_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, uint32_t EventSource, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_GenerateEvent_CALLBACK)(TIM_HandleTypeDef* htim, uint32_t EventSource, int cmock_num_calls);
void HAL_TIM_GenerateEvent_AddCallback(CMOCK_HAL_TIM_GenerateEvent_CALLBACK Callback);
void HAL_TIM_GenerateEvent_Stub(CMOCK_HAL_TIM_GenerateEvent_CALLBACK Callback);
#define HAL_TIM_GenerateEvent_StubWithCallback HAL_TIM_GenerateEvent_Stub
#define HAL_TIM_ReadCapturedValue_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_ReadCapturedValue requires _IgnoreAndReturn");
#define HAL_TIM_ReadCapturedValue_IgnoreAndReturn(cmock_retval) HAL_TIM_ReadCapturedValue_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_ReadCapturedValue_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, uint32_t cmock_to_return);
#define HAL_TIM_ReadCapturedValue_StopIgnore() HAL_TIM_ReadCapturedValue_CMockStopIgnore()
void HAL_TIM_ReadCapturedValue_CMockStopIgnore(void);
#define HAL_TIM_ReadCapturedValue_Expect(htim, Channel) TEST_FAIL_MESSAGE("HAL_TIM_ReadCapturedValue requires _ExpectAndReturn");
#define HAL_TIM_ReadCapturedValue_ExpectAndReturn(htim, Channel, cmock_retval) HAL_TIM_ReadCapturedValue_CMockExpectAndReturn(__LINE__, htim, Channel, cmock_retval)
void HAL_TIM_ReadCapturedValue_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, const TIM_HandleTypeDef* htim, uint32_t Channel, uint32_t cmock_to_return);
typedef uint32_t (* CMOCK_HAL_TIM_ReadCapturedValue_CALLBACK)(const TIM_HandleTypeDef* htim, uint32_t Channel, int cmock_num_calls);
void HAL_TIM_ReadCapturedValue_AddCallback(CMOCK_HAL_TIM_ReadCapturedValue_CALLBACK Callback);
void HAL_TIM_ReadCapturedValue_Stub(CMOCK_HAL_TIM_ReadCapturedValue_CALLBACK Callback);
#define HAL_TIM_ReadCapturedValue_StubWithCallback HAL_TIM_ReadCapturedValue_Stub
#define HAL_TIM_PeriodElapsedCallback_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_PeriodElapsedCallback requires _Ignore (not AndReturn)");
#define HAL_TIM_PeriodElapsedCallback_Ignore() HAL_TIM_PeriodElapsedCallback_CMockIgnore()
void HAL_TIM_PeriodElapsedCallback_CMockIgnore(void);
#define HAL_TIM_PeriodElapsedCallback_StopIgnore() HAL_TIM_PeriodElapsedCallback_CMockStopIgnore()
void HAL_TIM_PeriodElapsedCallback_CMockStopIgnore(void);
#define HAL_TIM_PeriodElapsedCallback_ExpectAndReturn(htim, cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_PeriodElapsedCallback requires _Expect (not AndReturn)");
#define HAL_TIM_PeriodElapsedCallback_Expect(htim) HAL_TIM_PeriodElapsedCallback_CMockExpect(__LINE__, htim)
void HAL_TIM_PeriodElapsedCallback_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim);
typedef void (* CMOCK_HAL_TIM_PeriodElapsedCallback_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_PeriodElapsedCallback_AddCallback(CMOCK_HAL_TIM_PeriodElapsedCallback_CALLBACK Callback);
void HAL_TIM_PeriodElapsedCallback_Stub(CMOCK_HAL_TIM_PeriodElapsedCallback_CALLBACK Callback);
#define HAL_TIM_PeriodElapsedCallback_StubWithCallback HAL_TIM_PeriodElapsedCallback_Stub
#define HAL_TIM_PeriodElapsedHalfCpltCallback_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_PeriodElapsedHalfCpltCallback requires _Ignore (not AndReturn)");
#define HAL_TIM_PeriodElapsedHalfCpltCallback_Ignore() HAL_TIM_PeriodElapsedHalfCpltCallback_CMockIgnore()
void HAL_TIM_PeriodElapsedHalfCpltCallback_CMockIgnore(void);
#define HAL_TIM_PeriodElapsedHalfCpltCallback_StopIgnore() HAL_TIM_PeriodElapsedHalfCpltCallback_CMockStopIgnore()
void HAL_TIM_PeriodElapsedHalfCpltCallback_CMockStopIgnore(void);
#define HAL_TIM_PeriodElapsedHalfCpltCallback_ExpectAndReturn(htim, cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_PeriodElapsedHalfCpltCallback requires _Expect (not AndReturn)");
#define HAL_TIM_PeriodElapsedHalfCpltCallback_Expect(htim) HAL_TIM_PeriodElapsedHalfCpltCallback_CMockExpect(__LINE__, htim)
void HAL_TIM_PeriodElapsedHalfCpltCallback_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim);
typedef void (* CMOCK_HAL_TIM_PeriodElapsedHalfCpltCallback_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_PeriodElapsedHalfCpltCallback_AddCallback(CMOCK_HAL_TIM_PeriodElapsedHalfCpltCallback_CALLBACK Callback);
void HAL_TIM_PeriodElapsedHalfCpltCallback_Stub(CMOCK_HAL_TIM_PeriodElapsedHalfCpltCallback_CALLBACK Callback);
#define HAL_TIM_PeriodElapsedHalfCpltCallback_StubWithCallback HAL_TIM_PeriodElapsedHalfCpltCallback_Stub
#define HAL_TIM_OC_DelayElapsedCallback_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_OC_DelayElapsedCallback requires _Ignore (not AndReturn)");
#define HAL_TIM_OC_DelayElapsedCallback_Ignore() HAL_TIM_OC_DelayElapsedCallback_CMockIgnore()
void HAL_TIM_OC_DelayElapsedCallback_CMockIgnore(void);
#define HAL_TIM_OC_DelayElapsedCallback_StopIgnore() HAL_TIM_OC_DelayElapsedCallback_CMockStopIgnore()
void HAL_TIM_OC_DelayElapsedCallback_CMockStopIgnore(void);
#define HAL_TIM_OC_DelayElapsedCallback_ExpectAndReturn(htim, cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_OC_DelayElapsedCallback requires _Expect (not AndReturn)");
#define HAL_TIM_OC_DelayElapsedCallback_Expect(htim) HAL_TIM_OC_DelayElapsedCallback_CMockExpect(__LINE__, htim)
void HAL_TIM_OC_DelayElapsedCallback_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim);
typedef void (* CMOCK_HAL_TIM_OC_DelayElapsedCallback_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_OC_DelayElapsedCallback_AddCallback(CMOCK_HAL_TIM_OC_DelayElapsedCallback_CALLBACK Callback);
void HAL_TIM_OC_DelayElapsedCallback_Stub(CMOCK_HAL_TIM_OC_DelayElapsedCallback_CALLBACK Callback);
#define HAL_TIM_OC_DelayElapsedCallback_StubWithCallback HAL_TIM_OC_DelayElapsedCallback_Stub
#define HAL_TIM_IC_CaptureCallback_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_IC_CaptureCallback requires _Ignore (not AndReturn)");
#define HAL_TIM_IC_CaptureCallback_Ignore() HAL_TIM_IC_CaptureCallback_CMockIgnore()
void HAL_TIM_IC_CaptureCallback_CMockIgnore(void);
#define HAL_TIM_IC_CaptureCallback_StopIgnore() HAL_TIM_IC_CaptureCallback_CMockStopIgnore()
void HAL_TIM_IC_CaptureCallback_CMockStopIgnore(void);
#define HAL_TIM_IC_CaptureCallback_ExpectAndReturn(htim, cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_IC_CaptureCallback requires _Expect (not AndReturn)");
#define HAL_TIM_IC_CaptureCallback_Expect(htim) HAL_TIM_IC_CaptureCallback_CMockExpect(__LINE__, htim)
void HAL_TIM_IC_CaptureCallback_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim);
typedef void (* CMOCK_HAL_TIM_IC_CaptureCallback_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_IC_CaptureCallback_AddCallback(CMOCK_HAL_TIM_IC_CaptureCallback_CALLBACK Callback);
void HAL_TIM_IC_CaptureCallback_Stub(CMOCK_HAL_TIM_IC_CaptureCallback_CALLBACK Callback);
#define HAL_TIM_IC_CaptureCallback_StubWithCallback HAL_TIM_IC_CaptureCallback_Stub
#define HAL_TIM_IC_CaptureHalfCpltCallback_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_IC_CaptureHalfCpltCallback requires _Ignore (not AndReturn)");
#define HAL_TIM_IC_CaptureHalfCpltCallback_Ignore() HAL_TIM_IC_CaptureHalfCpltCallback_CMockIgnore()
void HAL_TIM_IC_CaptureHalfCpltCallback_CMockIgnore(void);
#define HAL_TIM_IC_CaptureHalfCpltCallback_StopIgnore() HAL_TIM_IC_CaptureHalfCpltCallback_CMockStopIgnore()
void HAL_TIM_IC_CaptureHalfCpltCallback_CMockStopIgnore(void);
#define HAL_TIM_IC_CaptureHalfCpltCallback_ExpectAndReturn(htim, cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_IC_CaptureHalfCpltCallback requires _Expect (not AndReturn)");
#define HAL_TIM_IC_CaptureHalfCpltCallback_Expect(htim) HAL_TIM_IC_CaptureHalfCpltCallback_CMockExpect(__LINE__, htim)
void HAL_TIM_IC_CaptureHalfCpltCallback_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim);
typedef void (* CMOCK_HAL_TIM_IC_CaptureHalfCpltCallback_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_IC_CaptureHalfCpltCallback_AddCallback(CMOCK_HAL_TIM_IC_CaptureHalfCpltCallback_CALLBACK Callback);
void HAL_TIM_IC_CaptureHalfCpltCallback_Stub(CMOCK_HAL_TIM_IC_CaptureHalfCpltCallback_CALLBACK Callback);
#define HAL_TIM_IC_CaptureHalfCpltCallback_StubWithCallback HAL_TIM_IC_CaptureHalfCpltCallback_Stub
#define HAL_TIM_PWM_PulseFinishedCallback_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_PWM_PulseFinishedCallback requires _Ignore (not AndReturn)");
#define HAL_TIM_PWM_PulseFinishedCallback_Ignore() HAL_TIM_PWM_PulseFinishedCallback_CMockIgnore()
void HAL_TIM_PWM_PulseFinishedCallback_CMockIgnore(void);
#define HAL_TIM_PWM_PulseFinishedCallback_StopIgnore() HAL_TIM_PWM_PulseFinishedCallback_CMockStopIgnore()
void HAL_TIM_PWM_PulseFinishedCallback_CMockStopIgnore(void);
#define HAL_TIM_PWM_PulseFinishedCallback_ExpectAndReturn(htim, cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_PWM_PulseFinishedCallback requires _Expect (not AndReturn)");
#define HAL_TIM_PWM_PulseFinishedCallback_Expect(htim) HAL_TIM_PWM_PulseFinishedCallback_CMockExpect(__LINE__, htim)
void HAL_TIM_PWM_PulseFinishedCallback_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim);
typedef void (* CMOCK_HAL_TIM_PWM_PulseFinishedCallback_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_PWM_PulseFinishedCallback_AddCallback(CMOCK_HAL_TIM_PWM_PulseFinishedCallback_CALLBACK Callback);
void HAL_TIM_PWM_PulseFinishedCallback_Stub(CMOCK_HAL_TIM_PWM_PulseFinishedCallback_CALLBACK Callback);
#define HAL_TIM_PWM_PulseFinishedCallback_StubWithCallback HAL_TIM_PWM_PulseFinishedCallback_Stub
#define HAL_TIM_PWM_PulseFinishedHalfCpltCallback_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_PWM_PulseFinishedHalfCpltCallback requires _Ignore (not AndReturn)");
#define HAL_TIM_PWM_PulseFinishedHalfCpltCallback_Ignore() HAL_TIM_PWM_PulseFinishedHalfCpltCallback_CMockIgnore()
void HAL_TIM_PWM_PulseFinishedHalfCpltCallback_CMockIgnore(void);
#define HAL_TIM_PWM_PulseFinishedHalfCpltCallback_StopIgnore() HAL_TIM_PWM_PulseFinishedHalfCpltCallback_CMockStopIgnore()
void HAL_TIM_PWM_PulseFinishedHalfCpltCallback_CMockStopIgnore(void);
#define HAL_TIM_PWM_PulseFinishedHalfCpltCallback_ExpectAndReturn(htim, cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_PWM_PulseFinishedHalfCpltCallback requires _Expect (not AndReturn)");
#define HAL_TIM_PWM_PulseFinishedHalfCpltCallback_Expect(htim) HAL_TIM_PWM_PulseFinishedHalfCpltCallback_CMockExpect(__LINE__, htim)
void HAL_TIM_PWM_PulseFinishedHalfCpltCallback_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim);
typedef void (* CMOCK_HAL_TIM_PWM_PulseFinishedHalfCpltCallback_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_PWM_PulseFinishedHalfCpltCallback_AddCallback(CMOCK_HAL_TIM_PWM_PulseFinishedHalfCpltCallback_CALLBACK Callback);
void HAL_TIM_PWM_PulseFinishedHalfCpltCallback_Stub(CMOCK_HAL_TIM_PWM_PulseFinishedHalfCpltCallback_CALLBACK Callback);
#define HAL_TIM_PWM_PulseFinishedHalfCpltCallback_StubWithCallback HAL_TIM_PWM_PulseFinishedHalfCpltCallback_Stub
#define HAL_TIM_TriggerCallback_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_TriggerCallback requires _Ignore (not AndReturn)");
#define HAL_TIM_TriggerCallback_Ignore() HAL_TIM_TriggerCallback_CMockIgnore()
void HAL_TIM_TriggerCallback_CMockIgnore(void);
#define HAL_TIM_TriggerCallback_StopIgnore() HAL_TIM_TriggerCallback_CMockStopIgnore()
void HAL_TIM_TriggerCallback_CMockStopIgnore(void);
#define HAL_TIM_TriggerCallback_ExpectAndReturn(htim, cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_TriggerCallback requires _Expect (not AndReturn)");
#define HAL_TIM_TriggerCallback_Expect(htim) HAL_TIM_TriggerCallback_CMockExpect(__LINE__, htim)
void HAL_TIM_TriggerCallback_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim);
typedef void (* CMOCK_HAL_TIM_TriggerCallback_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_TriggerCallback_AddCallback(CMOCK_HAL_TIM_TriggerCallback_CALLBACK Callback);
void HAL_TIM_TriggerCallback_Stub(CMOCK_HAL_TIM_TriggerCallback_CALLBACK Callback);
#define HAL_TIM_TriggerCallback_StubWithCallback HAL_TIM_TriggerCallback_Stub
#define HAL_TIM_TriggerHalfCpltCallback_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_TriggerHalfCpltCallback requires _Ignore (not AndReturn)");
#define HAL_TIM_TriggerHalfCpltCallback_Ignore() HAL_TIM_TriggerHalfCpltCallback_CMockIgnore()
void HAL_TIM_TriggerHalfCpltCallback_CMockIgnore(void);
#define HAL_TIM_TriggerHalfCpltCallback_StopIgnore() HAL_TIM_TriggerHalfCpltCallback_CMockStopIgnore()
void HAL_TIM_TriggerHalfCpltCallback_CMockStopIgnore(void);
#define HAL_TIM_TriggerHalfCpltCallback_ExpectAndReturn(htim, cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_TriggerHalfCpltCallback requires _Expect (not AndReturn)");
#define HAL_TIM_TriggerHalfCpltCallback_Expect(htim) HAL_TIM_TriggerHalfCpltCallback_CMockExpect(__LINE__, htim)
void HAL_TIM_TriggerHalfCpltCallback_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim);
typedef void (* CMOCK_HAL_TIM_TriggerHalfCpltCallback_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_TriggerHalfCpltCallback_AddCallback(CMOCK_HAL_TIM_TriggerHalfCpltCallback_CALLBACK Callback);
void HAL_TIM_TriggerHalfCpltCallback_Stub(CMOCK_HAL_TIM_TriggerHalfCpltCallback_CALLBACK Callback);
#define HAL_TIM_TriggerHalfCpltCallback_StubWithCallback HAL_TIM_TriggerHalfCpltCallback_Stub
#define HAL_TIM_ErrorCallback_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_ErrorCallback requires _Ignore (not AndReturn)");
#define HAL_TIM_ErrorCallback_Ignore() HAL_TIM_ErrorCallback_CMockIgnore()
void HAL_TIM_ErrorCallback_CMockIgnore(void);
#define HAL_TIM_ErrorCallback_StopIgnore() HAL_TIM_ErrorCallback_CMockStopIgnore()
void HAL_TIM_ErrorCallback_CMockStopIgnore(void);
#define HAL_TIM_ErrorCallback_ExpectAndReturn(htim, cmock_retval) TEST_FAIL_MESSAGE("HAL_TIM_ErrorCallback requires _Expect (not AndReturn)");
#define HAL_TIM_ErrorCallback_Expect(htim) HAL_TIM_ErrorCallback_CMockExpect(__LINE__, htim)
void HAL_TIM_ErrorCallback_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim);
typedef void (* CMOCK_HAL_TIM_ErrorCallback_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_ErrorCallback_AddCallback(CMOCK_HAL_TIM_ErrorCallback_CALLBACK Callback);
void HAL_TIM_ErrorCallback_Stub(CMOCK_HAL_TIM_ErrorCallback_CALLBACK Callback);
#define HAL_TIM_ErrorCallback_StubWithCallback HAL_TIM_ErrorCallback_Stub
#define HAL_TIM_RegisterCallback_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_RegisterCallback requires _IgnoreAndReturn");
#define HAL_TIM_RegisterCallback_IgnoreAndReturn(cmock_retval) HAL_TIM_RegisterCallback_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_RegisterCallback_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_RegisterCallback_StopIgnore() HAL_TIM_RegisterCallback_CMockStopIgnore()
void HAL_TIM_RegisterCallback_CMockStopIgnore(void);
#define HAL_TIM_RegisterCallback_Expect(htim, CallbackID, pCallback) TEST_FAIL_MESSAGE("HAL_TIM_RegisterCallback requires _ExpectAndReturn");
#define HAL_TIM_RegisterCallback_ExpectAndReturn(htim, CallbackID, pCallback, cmock_retval) HAL_TIM_RegisterCallback_CMockExpectAndReturn(__LINE__, htim, CallbackID, pCallback, cmock_retval)
void HAL_TIM_RegisterCallback_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, HAL_TIM_CallbackIDTypeDef CallbackID, pTIM_CallbackTypeDef pCallback, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_RegisterCallback_CALLBACK)(TIM_HandleTypeDef* htim, HAL_TIM_CallbackIDTypeDef CallbackID, pTIM_CallbackTypeDef pCallback, int cmock_num_calls);
void HAL_TIM_RegisterCallback_AddCallback(CMOCK_HAL_TIM_RegisterCallback_CALLBACK Callback);
void HAL_TIM_RegisterCallback_Stub(CMOCK_HAL_TIM_RegisterCallback_CALLBACK Callback);
#define HAL_TIM_RegisterCallback_StubWithCallback HAL_TIM_RegisterCallback_Stub
#define HAL_TIM_UnRegisterCallback_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_UnRegisterCallback requires _IgnoreAndReturn");
#define HAL_TIM_UnRegisterCallback_IgnoreAndReturn(cmock_retval) HAL_TIM_UnRegisterCallback_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_UnRegisterCallback_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_TIM_UnRegisterCallback_StopIgnore() HAL_TIM_UnRegisterCallback_CMockStopIgnore()
void HAL_TIM_UnRegisterCallback_CMockStopIgnore(void);
#define HAL_TIM_UnRegisterCallback_Expect(htim, CallbackID) TEST_FAIL_MESSAGE("HAL_TIM_UnRegisterCallback requires _ExpectAndReturn");
#define HAL_TIM_UnRegisterCallback_ExpectAndReturn(htim, CallbackID, cmock_retval) HAL_TIM_UnRegisterCallback_CMockExpectAndReturn(__LINE__, htim, CallbackID, cmock_retval)
void HAL_TIM_UnRegisterCallback_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim, HAL_TIM_CallbackIDTypeDef CallbackID, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_TIM_UnRegisterCallback_CALLBACK)(TIM_HandleTypeDef* htim, HAL_TIM_CallbackIDTypeDef CallbackID, int cmock_num_calls);
void HAL_TIM_UnRegisterCallback_AddCallback(CMOCK_HAL_TIM_UnRegisterCallback_CALLBACK Callback);
void HAL_TIM_UnRegisterCallback_Stub(CMOCK_HAL_TIM_UnRegisterCallback_CALLBACK Callback);
#define HAL_TIM_UnRegisterCallback_StubWithCallback HAL_TIM_UnRegisterCallback_Stub
#define HAL_TIM_Base_GetState_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_Base_GetState requires _IgnoreAndReturn");
#define HAL_TIM_Base_GetState_IgnoreAndReturn(cmock_retval) HAL_TIM_Base_GetState_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_Base_GetState_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_TIM_StateTypeDef cmock_to_return);
#define HAL_TIM_Base_GetState_StopIgnore() HAL_TIM_Base_GetState_CMockStopIgnore()
void HAL_TIM_Base_GetState_CMockStopIgnore(void);
#define HAL_TIM_Base_GetState_Expect(htim) TEST_FAIL_MESSAGE("HAL_TIM_Base_GetState requires _ExpectAndReturn");
#define HAL_TIM_Base_GetState_ExpectAndReturn(htim, cmock_retval) HAL_TIM_Base_GetState_CMockExpectAndReturn(__LINE__, htim, cmock_retval)
void HAL_TIM_Base_GetState_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, const TIM_HandleTypeDef* htim, HAL_TIM_StateTypeDef cmock_to_return);
typedef HAL_TIM_StateTypeDef (* CMOCK_HAL_TIM_Base_GetState_CALLBACK)(const TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_Base_GetState_AddCallback(CMOCK_HAL_TIM_Base_GetState_CALLBACK Callback);
void HAL_TIM_Base_GetState_Stub(CMOCK_HAL_TIM_Base_GetState_CALLBACK Callback);
#define HAL_TIM_Base_GetState_StubWithCallback HAL_TIM_Base_GetState_Stub
#define HAL_TIM_OC_GetState_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_OC_GetState requires _IgnoreAndReturn");
#define HAL_TIM_OC_GetState_IgnoreAndReturn(cmock_retval) HAL_TIM_OC_GetState_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_OC_GetState_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_TIM_StateTypeDef cmock_to_return);
#define HAL_TIM_OC_GetState_StopIgnore() HAL_TIM_OC_GetState_CMockStopIgnore()
void HAL_TIM_OC_GetState_CMockStopIgnore(void);
#define HAL_TIM_OC_GetState_Expect(htim) TEST_FAIL_MESSAGE("HAL_TIM_OC_GetState requires _ExpectAndReturn");
#define HAL_TIM_OC_GetState_ExpectAndReturn(htim, cmock_retval) HAL_TIM_OC_GetState_CMockExpectAndReturn(__LINE__, htim, cmock_retval)
void HAL_TIM_OC_GetState_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, const TIM_HandleTypeDef* htim, HAL_TIM_StateTypeDef cmock_to_return);
typedef HAL_TIM_StateTypeDef (* CMOCK_HAL_TIM_OC_GetState_CALLBACK)(const TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_OC_GetState_AddCallback(CMOCK_HAL_TIM_OC_GetState_CALLBACK Callback);
void HAL_TIM_OC_GetState_Stub(CMOCK_HAL_TIM_OC_GetState_CALLBACK Callback);
#define HAL_TIM_OC_GetState_StubWithCallback HAL_TIM_OC_GetState_Stub
#define HAL_TIM_PWM_GetState_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_PWM_GetState requires _IgnoreAndReturn");
#define HAL_TIM_PWM_GetState_IgnoreAndReturn(cmock_retval) HAL_TIM_PWM_GetState_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_PWM_GetState_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_TIM_StateTypeDef cmock_to_return);
#define HAL_TIM_PWM_GetState_StopIgnore() HAL_TIM_PWM_GetState_CMockStopIgnore()
void HAL_TIM_PWM_GetState_CMockStopIgnore(void);
#define HAL_TIM_PWM_GetState_Expect(htim) TEST_FAIL_MESSAGE("HAL_TIM_PWM_GetState requires _ExpectAndReturn");
#define HAL_TIM_PWM_GetState_ExpectAndReturn(htim, cmock_retval) HAL_TIM_PWM_GetState_CMockExpectAndReturn(__LINE__, htim, cmock_retval)
void HAL_TIM_PWM_GetState_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, const TIM_HandleTypeDef* htim, HAL_TIM_StateTypeDef cmock_to_return);
typedef HAL_TIM_StateTypeDef (* CMOCK_HAL_TIM_PWM_GetState_CALLBACK)(const TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_PWM_GetState_AddCallback(CMOCK_HAL_TIM_PWM_GetState_CALLBACK Callback);
void HAL_TIM_PWM_GetState_Stub(CMOCK_HAL_TIM_PWM_GetState_CALLBACK Callback);
#define HAL_TIM_PWM_GetState_StubWithCallback HAL_TIM_PWM_GetState_Stub
#define HAL_TIM_IC_GetState_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_IC_GetState requires _IgnoreAndReturn");
#define HAL_TIM_IC_GetState_IgnoreAndReturn(cmock_retval) HAL_TIM_IC_GetState_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_IC_GetState_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_TIM_StateTypeDef cmock_to_return);
#define HAL_TIM_IC_GetState_StopIgnore() HAL_TIM_IC_GetState_CMockStopIgnore()
void HAL_TIM_IC_GetState_CMockStopIgnore(void);
#define HAL_TIM_IC_GetState_Expect(htim) TEST_FAIL_MESSAGE("HAL_TIM_IC_GetState requires _ExpectAndReturn");
#define HAL_TIM_IC_GetState_ExpectAndReturn(htim, cmock_retval) HAL_TIM_IC_GetState_CMockExpectAndReturn(__LINE__, htim, cmock_retval)
void HAL_TIM_IC_GetState_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, const TIM_HandleTypeDef* htim, HAL_TIM_StateTypeDef cmock_to_return);
typedef HAL_TIM_StateTypeDef (* CMOCK_HAL_TIM_IC_GetState_CALLBACK)(const TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_IC_GetState_AddCallback(CMOCK_HAL_TIM_IC_GetState_CALLBACK Callback);
void HAL_TIM_IC_GetState_Stub(CMOCK_HAL_TIM_IC_GetState_CALLBACK Callback);
#define HAL_TIM_IC_GetState_StubWithCallback HAL_TIM_IC_GetState_Stub
#define HAL_TIM_OnePulse_GetState_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_OnePulse_GetState requires _IgnoreAndReturn");
#define HAL_TIM_OnePulse_GetState_IgnoreAndReturn(cmock_retval) HAL_TIM_OnePulse_GetState_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_OnePulse_GetState_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_TIM_StateTypeDef cmock_to_return);
#define HAL_TIM_OnePulse_GetState_StopIgnore() HAL_TIM_OnePulse_GetState_CMockStopIgnore()
void HAL_TIM_OnePulse_GetState_CMockStopIgnore(void);
#define HAL_TIM_OnePulse_GetState_Expect(htim) TEST_FAIL_MESSAGE("HAL_TIM_OnePulse_GetState requires _ExpectAndReturn");
#define HAL_TIM_OnePulse_GetState_ExpectAndReturn(htim, cmock_retval) HAL_TIM_OnePulse_GetState_CMockExpectAndReturn(__LINE__, htim, cmock_retval)
void HAL_TIM_OnePulse_GetState_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, const TIM_HandleTypeDef* htim, HAL_TIM_StateTypeDef cmock_to_return);
typedef HAL_TIM_StateTypeDef (* CMOCK_HAL_TIM_OnePulse_GetState_CALLBACK)(const TIM_HandleTypeDef* htim, int cmock_num_calls);
