chrydelezuch/3DPrinter/Tests/build/test/mocks/test_stepper_motor/mock_stm32f4xx_hal_tim.h
void HAL_TIM_OnePulse_GetState_AddCallback(CMOCK_HAL_TIM_OnePulse_GetState_CALLBACK Callback);
void HAL_TIM_OnePulse_GetState_Stub(CMOCK_HAL_TIM_OnePulse_GetState_CALLBACK Callback);
#define HAL_TIM_OnePulse_GetState_StubWithCallback HAL_TIM_OnePulse_GetState_Stub
#define HAL_TIM_Encoder_GetState_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_Encoder_GetState requires _IgnoreAndReturn");
#define HAL_TIM_Encoder_GetState_IgnoreAndReturn(cmock_retval) HAL_TIM_Encoder_GetState_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_Encoder_GetState_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_TIM_StateTypeDef cmock_to_return);
#define HAL_TIM_Encoder_GetState_StopIgnore() HAL_TIM_Encoder_GetState_CMockStopIgnore()
void HAL_TIM_Encoder_GetState_CMockStopIgnore(void);
#define HAL_TIM_Encoder_GetState_Expect(htim) TEST_FAIL_MESSAGE("HAL_TIM_Encoder_GetState requires _ExpectAndReturn");
#define HAL_TIM_Encoder_GetState_ExpectAndReturn(htim, cmock_retval) HAL_TIM_Encoder_GetState_CMockExpectAndReturn(__LINE__, htim, cmock_retval)
void HAL_TIM_Encoder_GetState_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, const TIM_HandleTypeDef* htim, HAL_TIM_StateTypeDef cmock_to_return);
typedef HAL_TIM_StateTypeDef (* CMOCK_HAL_TIM_Encoder_GetState_CALLBACK)(const TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_Encoder_GetState_AddCallback(CMOCK_HAL_TIM_Encoder_GetState_CALLBACK Callback);
void HAL_TIM_Encoder_GetState_Stub(CMOCK_HAL_TIM_Encoder_GetState_CALLBACK Callback);
#define HAL_TIM_Encoder_GetState_StubWithCallback HAL_TIM_Encoder_GetState_Stub
#define HAL_TIM_GetActiveChannel_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_GetActiveChannel requires _IgnoreAndReturn");
#define HAL_TIM_GetActiveChannel_IgnoreAndReturn(cmock_retval) HAL_TIM_GetActiveChannel_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_GetActiveChannel_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_TIM_ActiveChannel cmock_to_return);
#define HAL_TIM_GetActiveChannel_StopIgnore() HAL_TIM_GetActiveChannel_CMockStopIgnore()
void HAL_TIM_GetActiveChannel_CMockStopIgnore(void);
#define HAL_TIM_GetActiveChannel_Expect(htim) TEST_FAIL_MESSAGE("HAL_TIM_GetActiveChannel requires _ExpectAndReturn");
#define HAL_TIM_GetActiveChannel_ExpectAndReturn(htim, cmock_retval) HAL_TIM_GetActiveChannel_CMockExpectAndReturn(__LINE__, htim, cmock_retval)
void HAL_TIM_GetActiveChannel_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, const TIM_HandleTypeDef* htim, HAL_TIM_ActiveChannel cmock_to_return);
typedef HAL_TIM_ActiveChannel (* CMOCK_HAL_TIM_GetActiveChannel_CALLBACK)(const TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_GetActiveChannel_AddCallback(CMOCK_HAL_TIM_GetActiveChannel_CALLBACK Callback);
void HAL_TIM_GetActiveChannel_Stub(CMOCK_HAL_TIM_GetActiveChannel_CALLBACK Callback);
#define HAL_TIM_GetActiveChannel_StubWithCallback HAL_TIM_GetActiveChannel_Stub
#define HAL_TIM_GetChannelState_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_GetChannelState requires _IgnoreAndReturn");
#define HAL_TIM_GetChannelState_IgnoreAndReturn(cmock_retval) HAL_TIM_GetChannelState_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_GetChannelState_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_TIM_ChannelStateTypeDef cmock_to_return);
#define HAL_TIM_GetChannelState_StopIgnore() HAL_TIM_GetChannelState_CMockStopIgnore()
void HAL_TIM_GetChannelState_CMockStopIgnore(void);
#define HAL_TIM_GetChannelState_Expect(htim, Channel) TEST_FAIL_MESSAGE("HAL_TIM_GetChannelState requires _ExpectAndReturn");
#define HAL_TIM_GetChannelState_ExpectAndReturn(htim, Channel, cmock_retval) HAL_TIM_GetChannelState_CMockExpectAndReturn(__LINE__, htim, Channel, cmock_retval)
void HAL_TIM_GetChannelState_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, const TIM_HandleTypeDef* htim, uint32_t Channel, HAL_TIM_ChannelStateTypeDef cmock_to_return);
typedef HAL_TIM_ChannelStateTypeDef (* CMOCK_HAL_TIM_GetChannelState_CALLBACK)(const TIM_HandleTypeDef* htim, uint32_t Channel, int cmock_num_calls);
void HAL_TIM_GetChannelState_AddCallback(CMOCK_HAL_TIM_GetChannelState_CALLBACK Callback);
void HAL_TIM_GetChannelState_Stub(CMOCK_HAL_TIM_GetChannelState_CALLBACK Callback);
#define HAL_TIM_GetChannelState_StubWithCallback HAL_TIM_GetChannelState_Stub
#define HAL_TIM_DMABurstState_Ignore() TEST_FAIL_MESSAGE("HAL_TIM_DMABurstState requires _IgnoreAndReturn");
#define HAL_TIM_DMABurstState_IgnoreAndReturn(cmock_retval) HAL_TIM_DMABurstState_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_TIM_DMABurstState_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_TIM_DMABurstStateTypeDef cmock_to_return);
#define HAL_TIM_DMABurstState_StopIgnore() HAL_TIM_DMABurstState_CMockStopIgnore()
void HAL_TIM_DMABurstState_CMockStopIgnore(void);
#define HAL_TIM_DMABurstState_Expect(htim) TEST_FAIL_MESSAGE("HAL_TIM_DMABurstState requires _ExpectAndReturn");
#define HAL_TIM_DMABurstState_ExpectAndReturn(htim, cmock_retval) HAL_TIM_DMABurstState_CMockExpectAndReturn(__LINE__, htim, cmock_retval)
void HAL_TIM_DMABurstState_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, const TIM_HandleTypeDef* htim, HAL_TIM_DMABurstStateTypeDef cmock_to_return);
typedef HAL_TIM_DMABurstStateTypeDef (* CMOCK_HAL_TIM_DMABurstState_CALLBACK)(const TIM_HandleTypeDef* htim, int cmock_num_calls);
void HAL_TIM_DMABurstState_AddCallback(CMOCK_HAL_TIM_DMABurstState_CALLBACK Callback);
void HAL_TIM_DMABurstState_Stub(CMOCK_HAL_TIM_DMABurstState_CALLBACK Callback);
#define HAL_TIM_DMABurstState_StubWithCallback HAL_TIM_DMABurstState_Stub
#define TIM_Base_SetConfig_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("TIM_Base_SetConfig requires _Ignore (not AndReturn)");
#define TIM_Base_SetConfig_Ignore() TIM_Base_SetConfig_CMockIgnore()
void TIM_Base_SetConfig_CMockIgnore(void);
#define TIM_Base_SetConfig_StopIgnore() TIM_Base_SetConfig_CMockStopIgnore()
void TIM_Base_SetConfig_CMockStopIgnore(void);
#define TIM_Base_SetConfig_ExpectAndReturn(TIMx, Structure, cmock_retval) TEST_FAIL_MESSAGE("TIM_Base_SetConfig requires _Expect (not AndReturn)");
#define TIM_Base_SetConfig_Expect(TIMx, Structure) TIM_Base_SetConfig_CMockExpect(__LINE__, TIMx, Structure)
void TIM_Base_SetConfig_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_TypeDef* TIMx, const TIM_Base_InitTypeDef* Structure);
typedef void (* CMOCK_TIM_Base_SetConfig_CALLBACK)(TIM_TypeDef* TIMx, const TIM_Base_InitTypeDef* Structure, int cmock_num_calls);
void TIM_Base_SetConfig_AddCallback(CMOCK_TIM_Base_SetConfig_CALLBACK Callback);
void TIM_Base_SetConfig_Stub(CMOCK_TIM_Base_SetConfig_CALLBACK Callback);
#define TIM_Base_SetConfig_StubWithCallback TIM_Base_SetConfig_Stub
#define TIM_TI1_SetConfig_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("TIM_TI1_SetConfig requires _Ignore (not AndReturn)");
#define TIM_TI1_SetConfig_Ignore() TIM_TI1_SetConfig_CMockIgnore()
void TIM_TI1_SetConfig_CMockIgnore(void);
#define TIM_TI1_SetConfig_StopIgnore() TIM_TI1_SetConfig_CMockStopIgnore()
void TIM_TI1_SetConfig_CMockStopIgnore(void);
#define TIM_TI1_SetConfig_ExpectAndReturn(TIMx, TIM_ICPolarity, TIM_ICSelection, TIM_ICFilter, cmock_retval) TEST_FAIL_MESSAGE("TIM_TI1_SetConfig requires _Expect (not AndReturn)");
#define TIM_TI1_SetConfig_Expect(TIMx, TIM_ICPolarity, TIM_ICSelection, TIM_ICFilter) TIM_TI1_SetConfig_CMockExpect(__LINE__, TIMx, TIM_ICPolarity, TIM_ICSelection, TIM_ICFilter)
void TIM_TI1_SetConfig_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_TypeDef* TIMx, uint32_t TIM_ICPolarity, uint32_t TIM_ICSelection, uint32_t TIM_ICFilter);
typedef void (* CMOCK_TIM_TI1_SetConfig_CALLBACK)(TIM_TypeDef* TIMx, uint32_t TIM_ICPolarity, uint32_t TIM_ICSelection, uint32_t TIM_ICFilter, int cmock_num_calls);
void TIM_TI1_SetConfig_AddCallback(CMOCK_TIM_TI1_SetConfig_CALLBACK Callback);
void TIM_TI1_SetConfig_Stub(CMOCK_TIM_TI1_SetConfig_CALLBACK Callback);
#define TIM_TI1_SetConfig_StubWithCallback TIM_TI1_SetConfig_Stub
#define TIM_OC2_SetConfig_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("TIM_OC2_SetConfig requires _Ignore (not AndReturn)");
#define TIM_OC2_SetConfig_Ignore() TIM_OC2_SetConfig_CMockIgnore()
void TIM_OC2_SetConfig_CMockIgnore(void);
#define TIM_OC2_SetConfig_StopIgnore() TIM_OC2_SetConfig_CMockStopIgnore()
void TIM_OC2_SetConfig_CMockStopIgnore(void);
#define TIM_OC2_SetConfig_ExpectAndReturn(TIMx, OC_Config, cmock_retval) TEST_FAIL_MESSAGE("TIM_OC2_SetConfig requires _Expect (not AndReturn)");
#define TIM_OC2_SetConfig_Expect(TIMx, OC_Config) TIM_OC2_SetConfig_CMockExpect(__LINE__, TIMx, OC_Config)
void TIM_OC2_SetConfig_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_TypeDef* TIMx, const TIM_OC_InitTypeDef* OC_Config);
typedef void (* CMOCK_TIM_OC2_SetConfig_CALLBACK)(TIM_TypeDef* TIMx, const TIM_OC_InitTypeDef* OC_Config, int cmock_num_calls);
void TIM_OC2_SetConfig_AddCallback(CMOCK_TIM_OC2_SetConfig_CALLBACK Callback);
void TIM_OC2_SetConfig_Stub(CMOCK_TIM_OC2_SetConfig_CALLBACK Callback);
#define TIM_OC2_SetConfig_StubWithCallback TIM_OC2_SetConfig_Stub
#define TIM_ETR_SetConfig_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("TIM_ETR_SetConfig requires _Ignore (not AndReturn)");
#define TIM_ETR_SetConfig_Ignore() TIM_ETR_SetConfig_CMockIgnore()
void TIM_ETR_SetConfig_CMockIgnore(void);
#define TIM_ETR_SetConfig_StopIgnore() TIM_ETR_SetConfig_CMockStopIgnore()
void TIM_ETR_SetConfig_CMockStopIgnore(void);
#define TIM_ETR_SetConfig_ExpectAndReturn(TIMx, TIM_ExtTRGPrescaler, TIM_ExtTRGPolarity, ExtTRGFilter, cmock_retval) TEST_FAIL_MESSAGE("TIM_ETR_SetConfig requires _Expect (not AndReturn)");
#define TIM_ETR_SetConfig_Expect(TIMx, TIM_ExtTRGPrescaler, TIM_ExtTRGPolarity, ExtTRGFilter) TIM_ETR_SetConfig_CMockExpect(__LINE__, TIMx, TIM_ExtTRGPrescaler, TIM_ExtTRGPolarity, ExtTRGFilter)
void TIM_ETR_SetConfig_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_TypeDef* TIMx, uint32_t TIM_ExtTRGPrescaler, uint32_t TIM_ExtTRGPolarity, uint32_t ExtTRGFilter);
typedef void (* CMOCK_TIM_ETR_SetConfig_CALLBACK)(TIM_TypeDef* TIMx, uint32_t TIM_ExtTRGPrescaler, uint32_t TIM_ExtTRGPolarity, uint32_t ExtTRGFilter, int cmock_num_calls);
void TIM_ETR_SetConfig_AddCallback(CMOCK_TIM_ETR_SetConfig_CALLBACK Callback);
void TIM_ETR_SetConfig_Stub(CMOCK_TIM_ETR_SetConfig_CALLBACK Callback);
#define TIM_ETR_SetConfig_StubWithCallback TIM_ETR_SetConfig_Stub
#define TIM_DMADelayPulseHalfCplt_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("TIM_DMADelayPulseHalfCplt requires _Ignore (not AndReturn)");
#define TIM_DMADelayPulseHalfCplt_Ignore() TIM_DMADelayPulseHalfCplt_CMockIgnore()
void TIM_DMADelayPulseHalfCplt_CMockIgnore(void);
#define TIM_DMADelayPulseHalfCplt_StopIgnore() TIM_DMADelayPulseHalfCplt_CMockStopIgnore()
void TIM_DMADelayPulseHalfCplt_CMockStopIgnore(void);
#define TIM_DMADelayPulseHalfCplt_ExpectAndReturn(hdma, cmock_retval) TEST_FAIL_MESSAGE("TIM_DMADelayPulseHalfCplt requires _Expect (not AndReturn)");
#define TIM_DMADelayPulseHalfCplt_Expect(hdma) TIM_DMADelayPulseHalfCplt_CMockExpect(__LINE__, hdma)
void TIM_DMADelayPulseHalfCplt_CMockExpect(UNITY_LINE_TYPE cmock_line, DMA_HandleTypeDef* hdma);
typedef void (* CMOCK_TIM_DMADelayPulseHalfCplt_CALLBACK)(DMA_HandleTypeDef* hdma, int cmock_num_calls);
void TIM_DMADelayPulseHalfCplt_AddCallback(CMOCK_TIM_DMADelayPulseHalfCplt_CALLBACK Callback);
void TIM_DMADelayPulseHalfCplt_Stub(CMOCK_TIM_DMADelayPulseHalfCplt_CALLBACK Callback);
#define TIM_DMADelayPulseHalfCplt_StubWithCallback TIM_DMADelayPulseHalfCplt_Stub
#define TIM_DMAError_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("TIM_DMAError requires _Ignore (not AndReturn)");
#define TIM_DMAError_Ignore() TIM_DMAError_CMockIgnore()
void TIM_DMAError_CMockIgnore(void);
#define TIM_DMAError_StopIgnore() TIM_DMAError_CMockStopIgnore()
void TIM_DMAError_CMockStopIgnore(void);
#define TIM_DMAError_ExpectAndReturn(hdma, cmock_retval) TEST_FAIL_MESSAGE("TIM_DMAError requires _Expect (not AndReturn)");
#define TIM_DMAError_Expect(hdma) TIM_DMAError_CMockExpect(__LINE__, hdma)
void TIM_DMAError_CMockExpect(UNITY_LINE_TYPE cmock_line, DMA_HandleTypeDef* hdma);
typedef void (* CMOCK_TIM_DMAError_CALLBACK)(DMA_HandleTypeDef* hdma, int cmock_num_calls);
void TIM_DMAError_AddCallback(CMOCK_TIM_DMAError_CALLBACK Callback);
void TIM_DMAError_Stub(CMOCK_TIM_DMAError_CALLBACK Callback);
#define TIM_DMAError_StubWithCallback TIM_DMAError_Stub
#define TIM_DMACaptureCplt_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("TIM_DMACaptureCplt requires _Ignore (not AndReturn)");
#define TIM_DMACaptureCplt_Ignore() TIM_DMACaptureCplt_CMockIgnore()
void TIM_DMACaptureCplt_CMockIgnore(void);
#define TIM_DMACaptureCplt_StopIgnore() TIM_DMACaptureCplt_CMockStopIgnore()
void TIM_DMACaptureCplt_CMockStopIgnore(void);
#define TIM_DMACaptureCplt_ExpectAndReturn(hdma, cmock_retval) TEST_FAIL_MESSAGE("TIM_DMACaptureCplt requires _Expect (not AndReturn)");
#define TIM_DMACaptureCplt_Expect(hdma) TIM_DMACaptureCplt_CMockExpect(__LINE__, hdma)
void TIM_DMACaptureCplt_CMockExpect(UNITY_LINE_TYPE cmock_line, DMA_HandleTypeDef* hdma);
typedef void (* CMOCK_TIM_DMACaptureCplt_CALLBACK)(DMA_HandleTypeDef* hdma, int cmock_num_calls);
void TIM_DMACaptureCplt_AddCallback(CMOCK_TIM_DMACaptureCplt_CALLBACK Callback);
void TIM_DMACaptureCplt_Stub(CMOCK_TIM_DMACaptureCplt_CALLBACK Callback);
#define TIM_DMACaptureCplt_StubWithCallback TIM_DMACaptureCplt_Stub
#define TIM_DMACaptureHalfCplt_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("TIM_DMACaptureHalfCplt requires _Ignore (not AndReturn)");
#define TIM_DMACaptureHalfCplt_Ignore() TIM_DMACaptureHalfCplt_CMockIgnore()
void TIM_DMACaptureHalfCplt_CMockIgnore(void);
#define TIM_DMACaptureHalfCplt_StopIgnore() TIM_DMACaptureHalfCplt_CMockStopIgnore()
void TIM_DMACaptureHalfCplt_CMockStopIgnore(void);
#define TIM_DMACaptureHalfCplt_ExpectAndReturn(hdma, cmock_retval) TEST_FAIL_MESSAGE("TIM_DMACaptureHalfCplt requires _Expect (not AndReturn)");
#define TIM_DMACaptureHalfCplt_Expect(hdma) TIM_DMACaptureHalfCplt_CMockExpect(__LINE__, hdma)
void TIM_DMACaptureHalfCplt_CMockExpect(UNITY_LINE_TYPE cmock_line, DMA_HandleTypeDef* hdma);
typedef void (* CMOCK_TIM_DMACaptureHalfCplt_CALLBACK)(DMA_HandleTypeDef* hdma, int cmock_num_calls);
void TIM_DMACaptureHalfCplt_AddCallback(CMOCK_TIM_DMACaptureHalfCplt_CALLBACK Callback);
void TIM_DMACaptureHalfCplt_Stub(CMOCK_TIM_DMACaptureHalfCplt_CALLBACK Callback);
#define TIM_DMACaptureHalfCplt_StubWithCallback TIM_DMACaptureHalfCplt_Stub
#define TIM_CCxChannelCmd_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("TIM_CCxChannelCmd requires _Ignore (not AndReturn)");
#define TIM_CCxChannelCmd_Ignore() TIM_CCxChannelCmd_CMockIgnore()
void TIM_CCxChannelCmd_CMockIgnore(void);
#define TIM_CCxChannelCmd_StopIgnore() TIM_CCxChannelCmd_CMockStopIgnore()
void TIM_CCxChannelCmd_CMockStopIgnore(void);
#define TIM_CCxChannelCmd_ExpectAndReturn(TIMx, Channel, ChannelState, cmock_retval) TEST_FAIL_MESSAGE("TIM_CCxChannelCmd requires _Expect (not AndReturn)");
#define TIM_CCxChannelCmd_Expect(TIMx, Channel, ChannelState) TIM_CCxChannelCmd_CMockExpect(__LINE__, TIMx, Channel, ChannelState)
void TIM_CCxChannelCmd_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_TypeDef* TIMx, uint32_t Channel, uint32_t ChannelState);
typedef void (* CMOCK_TIM_CCxChannelCmd_CALLBACK)(TIM_TypeDef* TIMx, uint32_t Channel, uint32_t ChannelState, int cmock_num_calls);
void TIM_CCxChannelCmd_AddCallback(CMOCK_TIM_CCxChannelCmd_CALLBACK Callback);
void TIM_CCxChannelCmd_Stub(CMOCK_TIM_CCxChannelCmd_CALLBACK Callback);
#define TIM_CCxChannelCmd_StubWithCallback TIM_CCxChannelCmd_Stub
#define TIM_ResetCallback_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("TIM_ResetCallback requires _Ignore (not AndReturn)");
#define TIM_ResetCallback_Ignore() TIM_ResetCallback_CMockIgnore()
void TIM_ResetCallback_CMockIgnore(void);
#define TIM_ResetCallback_StopIgnore() TIM_ResetCallback_CMockStopIgnore()
void TIM_ResetCallback_CMockStopIgnore(void);
#define TIM_ResetCallback_ExpectAndReturn(htim, cmock_retval) TEST_FAIL_MESSAGE("TIM_ResetCallback requires _Expect (not AndReturn)");
#define TIM_ResetCallback_Expect(htim) TIM_ResetCallback_CMockExpect(__LINE__, htim)
void TIM_ResetCallback_CMockExpect(UNITY_LINE_TYPE cmock_line, TIM_HandleTypeDef* htim);
typedef void (* CMOCK_TIM_ResetCallback_CALLBACK)(TIM_HandleTypeDef* htim, int cmock_num_calls);
void TIM_ResetCallback_AddCallback(CMOCK_TIM_ResetCallback_CALLBACK Callback);
void TIM_ResetCallback_Stub(CMOCK_TIM_ResetCallback_CALLBACK Callback);
#define TIM_ResetCallback_StubWithCallback TIM_ResetCallback_Stub

#ifdef __cplusplus
}
#endif

#if defined(__GNUC__) && !defined(__ICC) && !defined(__TMS470__)
#if __GNUC__ > 4 || (__GNUC__ == 4 && (__GNUC_MINOR__ > 6 || (__GNUC_MINOR__ == 6 && __GNUC_PATCHLEVEL__ > 0)))
#pragma GCC diagnostic pop
#endif
#endif

#endif
